koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/*
 * Copyright (C) 2015 Analog Devices Inc.
 * Copyright (C) 2022-2023 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/** @addtogroup Analog Devices Inc.
  * @{
  */

/** @addtogroup ADUCM322
  * @{
  */

#ifndef ADUCM322_H_
#define ADUCM322_H_

#ifdef __cplusplus
extern "C" {
#endif 


/* ----------------------  Interrupt Number Definition  --------------------- */

typedef enum {
/* ----------------  Cortex-M3 Processor Exceptions Numbers  ---------------- */
  NonMaskableInt_IRQn       = -14,  /* Non Maskable Interrupt                 */
  HardFault_IRQn            = -13,  /* Hard Fault Interrupt                   */
  MemoryManagement_IRQn     = -12,  /* Memory Management Interrupt            */
  BusFault_IRQn             = -11,  /* Bus Fault Interrupt                    */
  UsageFault_IRQn           = -10,  /* Usage Fault Interrupt                  */
  SVCall_IRQn               = -5,   /* SV Call Interrupt via SVC instruction  */
  DebugMonitor_IRQn         = -4,   /* Debug Monitor Interrupt                */
  PendSV_IRQn               = -2,   /* Pend SV Interrupt                      */
  SysTick_IRQn              = -1,   /* System Tick Timer Interrupt            */
/* -----------------  ADUCM322 Specific Interrupt Numbers  ------------------ */
  WKUP_IRQn                 = 0,    /* Wakeup Timer Interrupt                 */
  EXTI0_IRQn                = 1,    /* External Interrupt 0                   */
  EXTI1_IRQn                = 2,    /* External Interrupt 1                   */
  EXTI2_IRQn                = 3,    /* External Interrupt 2                   */
  EXTI4_IRQn                = 5,    /* External Interrupt 4                   */
  EXTI5_IRQn                = 6,    /* External Interrupt 5                   */
  EXTI7_IRQn                = 8,    /* External Interrupt 7                   */
  EXTI8_IRQn                = 9,    /* External Interrupt 8                   */
  WDT_IRQn                  = 10,   /* Watchdog Timer Interrupt               */
  LVD0_IRQn                 = 13,   /* Low Voltage Die Interrupt 0            */
  MDIO_IRQn                 = 14,   /* MDIO Interrupt                         */
  TIM0_IRQn                 = 15,   /* Timer0 Interrupt                       */
  TIM1_IRQn                 = 16,   /* Timer1 Interrupt                       */
  FLASH_IRQn                = 17,   /* Flash Memory Interrupt                 */
  UART0_IRQn                = 18,   /* UART Interrupt                         */
  SPI0_IRQn                 = 19,   /* SPI0 Interrupt                         */
  SPI1_IRQn                 = 20,   /* SPI1 Interrupt                         */
  I2C0_Slave_IRQn           = 21,   /* I2C0 Slave Interrupt                   */
  I2C0_Master_IRQn          = 22,   /* I2C0 Master Interrupt                  */
  PLA0_IRQn                 = 23,   /* PLA0 Interrupt                         */
  PLA1_IRQn                 = 24,   /* PLA1 Interrupt                         */
  DMA_ERR_IRQn              = 25,   /* DMA Error Interrupt                    */
  DMA_SPI0_TX_IRQn          = 26,   /* DMA SPI0 TX Interrupt                  */
  DMA_SPI0_RX_IRQn          = 27,   /* DMA SPI0 RX Interrupt                  */
  DMA_SPI1_TX_IRQn          = 28,   /* DMA SPI1 TX Interrupt                  */
  DMA_SPI1_RX_IRQn          = 29,   /* DMA SPI1 RX Interrupt                  */
  DMA_UART0_TX_IRQn         = 30,   /* DMA UART TX Interrupt                  */
  DMA_UART0_RX_IRQn         = 31,   /* DMA UART RX Interrupt                  */
  DMA_I2C0_STX_IRQn         = 32,   /* DMA I2C0 Slave TX Interrupt            */
  DMA_I2C0_SRX_IRQn         = 33,   /* DMA I2C0 Slave RX Interrupt            */
  DMA_I2C0_M_IRQn           = 34,   /* DMA I2C0 Master Interrupt              */
  DMA_I2C1_STX_IRQn         = 35,   /* DMA I2C1 Slave TX Interrupt            */
  DMA_I2C1_SRX_IRQn         = 36,   /* DMA I2C1 Slave RX Interrupt            */
  DMA_I2C1_M_IRQn           = 37,   /* DMA I2C1 Master Interrupt              */
  DMA_ADC_IRQn              = 38,   /* DMA ADC Interrupt                      */
  DMA_FLASH_IRQn            = 39,   /* DMA Flash Interrupt                    */
  I2C1_Slave_IRQn           = 44,   /* I2C1 Slave Interrupt                   */
  I2C1_Master_IRQn          = 45,   /* I2C1 Master Interrupt                  */
  PLA2_IRQn                 = 46,   /* PLA2 Interrupt                         */
  PLA3_IRQn                 = 47,   /* PLA3 Interrupt                         */
  TIM2_IRQn                 = 48,   /* Timer2 Interrupt                       */
  LVD1_IRQn                 = 49,   /* Low Voltage Die Interrupt 1            */
  PWMT_IRQn                 = 50,   /* PWM TRIP Interrupt                     */
  PWM0_IRQn                 = 51,   /* PWM Channel Pair 0 interrupt           */
  PWM1_IRQn                 = 52,   /* PWM Channel Pair 1 interrupt           */
  PWM2_IRQn                 = 53,   /* PWM Channel Pair 2 interrupt           */
  PWM3_IRQn                 = 54    /* PWM Channel Pair 3 interrupt           */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the cm3 Processor and Core Peripherals---------------- */

#define __CM3_REV              0x0200       /*!< Cortex-M3 Core Revision          */
#define __MPU_PRESENT             0         /*!< MPU present or not                    */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */


#include <CMSIS/Core/Cortex/core_cm3.h>
#include "system_aducm32x.h"
#include <stdint.h>


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif




/* TLD[LOAD] - Load value */
#define TLD_LOAD_MSK                   (0xFFFF << 0  )

/* TVAL[VAL] - Current count */
#define TVAL_VAL_MSK                   (0xFFFF << 0  )

/* TCON[EVENTEN] - Event select */
#define TCON_EVENTEN_MSK               (0x1   << 12 )
#define TCON_EVENTEN                   (0x1   << 12 )
#define TCON_EVENTEN_DIS               (0x0   << 12 ) /* Events will not be captured */
#define TCON_EVENTEN_EN                (0x1   << 12 ) /* Events will be captured  */

/* TCON[EVENT] - Event select range */
#define TCON_EVENT_MSK                 (0xF   << 8  )

/* TCON[RLD] - Reload control */
#define TCON_RLD_MSK                   (0x1   << 7  )
#define TCON_RLD                       (0x1   << 7  )
#define TCON_RLD_EN                    (0x1   << 7  ) /* Resets the up/down counter when TCLRI[0] is set */
#define TCON_RLD_DIS                   (0x0   << 7  ) /* Up/Down counter is only reset on a timeout event */

/* TCON[CLK] - Clock select */
#define TCON_CLK_MSK                   (0x3   << 5  )
#define TCON_CLK_PCLK                  (0x0   << 5  ) /* PCLK.                    */
#define TCON_CLK_HCLK                  (0x1   << 5  ) /* HCLK.                    */
#define TCON_CLK_LFOSC                 (0x2   << 5  ) /* LFOSC. 32 KHz OSC        */
#define TCON_CLK_HFXTAL                (0x3   << 5  ) /* HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11) */

/* TCON[ENABLE] - Timer enable */
#define TCON_ENABLE_MSK                (0x1   << 4  )
#define TCON_ENABLE                    (0x1   << 4  )
#define TCON_ENABLE_DIS                (0x0   << 4  ) /* DIS. Timer is disabled (default) */
#define TCON_ENABLE_EN                 (0x1   << 4  ) /* EN. Timer is enabled     */

/* TCON[MOD] - Timer mode */
#define TCON_MOD_MSK                   (0x1   << 3  )
#define TCON_MOD                       (0x1   << 3  )
#define TCON_MOD_FREERUN               (0x0   << 3  ) /* FREERUN.Timer runs in free running mode */
#define TCON_MOD_PERIODIC              (0x1   << 3  ) /* PERIODIC. Timer runs in periodic mode (default) */

