koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* T3CON[PMD] - Power Mode Disable */
#define T3CON_PMD_BBA                  (*(volatile unsigned long *) 0x4204B100)
#define T3CON_PMD_MSK                  (0x1   << 0  )
#define T3CON_PMD                      (0x1   << 0  )
#define T3CON_PMD_DIS                  (0x0   << 0  ) /* DIS. The watchdog timer will continue its count down while in hibernate mode. */
#define T3CON_PMD_EN                   (0x1   << 0  ) /* EN. When hibernate mode is entered, the watchdog counter will suspend its count down. As hibernate mode is exited, the count down will resume from its current count value (the count will not be reset). */

/* Reset Value for T3CLRI*/
#define T3CLRI_RVAL                    0x0 

/* T3CLRI[CLRWDG] - Clear watchdog */
#define T3CLRI_CLRWDG_MSK              (0xFFFF << 0  )

/* Reset Value for T3STA*/
#define T3STA_RVAL                     0x0 

/* T3STA[LOCK] - Lock status bit */
#define T3STA_LOCK_BBA                 (*(volatile unsigned long *) 0x4204B310)
#define T3STA_LOCK_MSK                 (0x1   << 4  )
#define T3STA_LOCK                     (0x1   << 4  )
#define T3STA_LOCK_CLR                 (0x0   << 4  )
#define T3STA_LOCK_SET                 (0x1   << 4  )

/* T3STA[CON] - T3CON write sync in progress */
#define T3STA_CON_BBA                  (*(volatile unsigned long *) 0x4204B30C)
#define T3STA_CON_MSK                  (0x1   << 3  )
#define T3STA_CON                      (0x1   << 3  )
#define T3STA_CON_CLR                  (0x0   << 3  ) /* APB and T3 clock domains T3CON configuration values match */
#define T3STA_CON_SET                  (0x1   << 3  ) /* APB T3CON register values are being synchronized to T3 clock domain */

/* T3STA[LD] - T3LD write sync in progress */
#define T3STA_LD_BBA                   (*(volatile unsigned long *) 0x4204B308)
#define T3STA_LD_MSK                   (0x1   << 2  )
#define T3STA_LD                       (0x1   << 2  )
#define T3STA_LD_CLR                   (0x0   << 2  ) /* APB and T3 clock domains T3LD values match */
#define T3STA_LD_SET                   (0x1   << 2  ) /* APB T3LD value is being synchronized to T3 clock domain */

/* T3STA[CLRI] - T3CLRI write sync in progress */
#define T3STA_CLRI_BBA                 (*(volatile unsigned long *) 0x4204B304)
#define T3STA_CLRI_MSK                 (0x1   << 1  )
#define T3STA_CLRI                     (0x1   << 1  )
#define T3STA_CLRI_CLR                 (0x0   << 1  ) /* APB T3CLRI write sync not done/ */
#define T3STA_CLRI_SET                 (0x1   << 1  ) /* APB T3CLRI write is being synced to T3 clock domain. T3 will be restarted (if 0xCCCC was written) once sync is complete */
// ------------------------------------------------------------------------------------------------
// -----                                        wut                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief wut (pADI_WUT)
  */

typedef struct {                            /*!< pADI_WUT Structure                     */
  __IO uint16_t  T4VAL0;                    /*!< Current count value - LS 16 bits      */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  T4VAL1;                    /*!< Current count value - MS 16 bits      */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  T4CON;                     /*!< Control register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  T4INC;                     /*!< 12-bit interval for wakeup field A    */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  T4WUFB0;                   /*!< Wakeup field B - LS 16 bits           */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  T4WUFB1;                   /*!< Wakeup field B - MS 16 bits           */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  T4WUFC0;                   /*!< Wakeup field C - LS 16 bits           */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  T4WUFC1;                   /*!< Wakeup field C - MS 16 bits           */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  T4WUFD0;                   /*!< Wakeup field D - LS 16 bits           */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  T4WUFD1;                   /*!< Wakeup field D - MS 16 bits           */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  T4IEN;                     /*!< Interrupt enable register             */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  T4STA;                     /*!< Status register                       */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  T4CLRI;                    /*!< Clear interrupt register              */
  __I  uint16_t  RESERVED12[5];
  __IO uint16_t  T4WUFA0;                   /*!< Wakeup field A - LS 16 bits           */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  T4WUFA1;                   /*!< Wakeup field A - MS 16 bits           */
} ADI_WUT_TypeDef;

/* Reset Value for T4VAL0*/
#define T4VAL0_RVAL                    0x0 

/* T4VAL0[T4VALL] - Current count Low */
#define T4VAL0_T4VALL_MSK              (0xFFFF << 0  )

/* Reset Value for T4VAL1*/
#define T4VAL1_RVAL                    0x0 

/* T4VAL1[T4VALH] - Current count high */
#define T4VAL1_T4VALH_MSK              (0xFFFF << 0  )

/* Reset Value for T4CON*/
#define T4CON_RVAL                     0x40 

/* T4CON[STOP_WUFA] - Disables updating field A register T4WUFA */
#define T4CON_STOP_WUFA_BBA            (*(volatile unsigned long *) 0x4204A12C)
#define T4CON_STOP_WUFA_MSK            (0x1   << 11 )
#define T4CON_STOP_WUFA                (0x1   << 11 )
#define T4CON_STOP_WUFA_DIS            (0x0   << 11 )
#define T4CON_STOP_WUFA_EN             (0x1   << 11 )

/* T4CON[CLK] - Clock select */
#define T4CON_CLK_MSK                  (0x3   << 9  )
#define T4CON_CLK_PCLK                 (0x0   << 9  ) /* PCLK: PCLK (default)     */
#define T4CON_CLK_LFOSC                (0x1   << 9  ) /* LFOSC: 32 kHz internal oscillator */
#define T4CON_CLK_ECLKIN               (0x3   << 9  ) /* ECLKIN: External clock from P1.0 */

/* T4CON[WUEN] - Wakeup enable */
#define T4CON_WUEN_BBA                 (*(volatile unsigned long *) 0x4204A120)
#define T4CON_WUEN_MSK                 (0x1   << 8  )
#define T4CON_WUEN                     (0x1   << 8  )
#define T4CON_WUEN_DIS                 (0x0   << 8  ) /* DIS: Cleared by user to disable the wake up timer when the core clock is off */
#define T4CON_WUEN_EN                  (0x1   << 8  ) /* EN: Set by user to enable the wake up timer even when the core clock is off. */

/* T4CON[ENABLE] - Timer enable */
#define T4CON_ENABLE_BBA               (*(volatile unsigned long *) 0x4204A11C)
#define T4CON_ENABLE_MSK               (0x1   << 7  )
#define T4CON_ENABLE                   (0x1   << 7  )
#define T4CON_ENABLE_DIS               (0x0   << 7  ) /* DIS: Disable the timer (default). */
#define T4CON_ENABLE_EN                (0x1   << 7  ) /* EN: Enable the timer.    */

