koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* I2C0STX[I2CSTX] - Slave transmit register */
#define I2C0STX_I2CSTX_MSK             (0xFF  << 0  )

/* Reset Value for I2C0ALT*/
#define I2C0ALT_RVAL                   0x0 

/* I2C0ALT[ALT] - Slave Alt */
#define I2C0ALT_ALT_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID0*/
#define I2C0ID0_RVAL                   0x0 

/* I2C0ID0[ID0] - Slave device ID 0 */
#define I2C0ID0_ID0_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID1*/
#define I2C0ID1_RVAL                   0x0 

/* I2C0ID1[ID1] - Slave device ID 1 */
#define I2C0ID1_ID1_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID2*/
#define I2C0ID2_RVAL                   0x0 

/* I2C0ID2[ID2] - Slave device ID 2 */
#define I2C0ID2_ID2_MSK                (0xFF  << 0  )

/* Reset Value for I2C0ID3*/
#define I2C0ID3_RVAL                   0x0 

/* I2C0ID3[ID3] - Slave device ID 3 */
#define I2C0ID3_ID3_MSK                (0xFF  << 0  )

/* Reset Value for I2C0FSTA*/
#define I2C0FSTA_RVAL                  0x0 

/* I2C0FSTA[MFLUSH] - Flush the master transmit FIFO */
#define I2C0FSTA_MFLUSH_BBA            (*(volatile unsigned long *) 0x420609A4)
#define I2C0FSTA_MFLUSH_MSK            (0x1   << 9  )
#define I2C0FSTA_MFLUSH                (0x1   << 9  )
#define I2C0FSTA_MFLUSH_DIS            (0x0   << 9  ) /* Clearing to 0 has no effect. */
#define I2C0FSTA_MFLUSH_EN             (0x1   << 9  ) /* Set to 1 to flush the master transmit FIFO. The master transmit FIFO will have to flushed if arbitration is lost or a slave responds with a NACK. */

/* I2C0FSTA[SFLUSH] - Flush the slave transmit FIFO */
#define I2C0FSTA_SFLUSH_BBA            (*(volatile unsigned long *) 0x420609A0)
#define I2C0FSTA_SFLUSH_MSK            (0x1   << 8  )
#define I2C0FSTA_SFLUSH                (0x1   << 8  )
#define I2C0FSTA_SFLUSH_DIS            (0x0   << 8  ) /* Clearing to 0 has no effect. */
#define I2C0FSTA_SFLUSH_EN             (0x1   << 8  ) /* Set to 1 to flush the slave transmit FIFO. */

/* I2C0FSTA[MRXFSTA] - Master receive FIFO status */
#define I2C0FSTA_MRXFSTA_MSK           (0x3   << 6  )
#define I2C0FSTA_MRXFSTA_EMPTY         (0x0   << 6  ) /* FIFO empty               */
#define I2C0FSTA_MRXFSTA_ONEBYTE       (0x1   << 6  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_MRXFSTA_TWOBYTES      (0x2   << 6  ) /* 2 bytes in the FIFO      */

/* I2C0FSTA[MTXFSTA] - Master transmit FIFO status */
#define I2C0FSTA_MTXFSTA_MSK           (0x3   << 4  )
#define I2C0FSTA_MTXFSTA_EMPTY         (0x0   << 4  ) /* FIFO empty               */
#define I2C0FSTA_MTXFSTA_ONEBYTE       (0x1   << 4  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_MTXFSTA_TWOBYTES      (0x2   << 4  ) /* 2 bytes in the FIFO      */

/* I2C0FSTA[SRXFSTA] - Slave receive FIFO status */
#define I2C0FSTA_SRXFSTA_MSK           (0x3   << 2  )
#define I2C0FSTA_SRXFSTA_EMPTY         (0x0   << 2  ) /* FIFO empty               */
#define I2C0FSTA_SRXFSTA_ONEBYTE       (0x1   << 2  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_SRXFSTA_TWOBYTES      (0x2   << 2  ) /* 2 bytes in the FIFO      */

/* I2C0FSTA[STXFSTA] - Slave transmit FIFO status */
#define I2C0FSTA_STXFSTA_MSK           (0x3   << 0  )
#define I2C0FSTA_STXFSTA_EMPTY         (0x0   << 0  ) /* FIFO empty               */
#define I2C0FSTA_STXFSTA_ONEBYTE       (0x1   << 0  ) /* 1 bytes in the FIFO      */
#define I2C0FSTA_STXFSTA_TWOBYTES      (0x2   << 0  ) /* 2 bytes in the FIFO      */

/* Reset Value for I2C0SHCON*/
#define I2C0SHCON_RVAL                 0x0 

/* I2C0SHCON[RESET] - Reset START STOP detect circuit */
#define I2C0SHCON_RESET_BBA            (*(volatile unsigned long *) 0x42060A00)
#define I2C0SHCON_RESET_MSK            (0x1   << 0  )
#define I2C0SHCON_RESET                (0x1   << 0  )
#define I2C0SHCON_RESET_DIS            (0x0   << 0  )
#define I2C0SHCON_RESET_EN             (0x1   << 0  )

/* Reset Value for I2C0ASSCL*/
#define I2C0ASSCL_RVAL                 0x0 

/* I2C0ASSCL[SSRTSTA] - stretch timeout for slave */
#define I2C0ASSCL_SSRTSTA_BBA          (*(volatile unsigned long *) 0x42060B24)
#define I2C0ASSCL_SSRTSTA_MSK          (0x1   << 9  )
#define I2C0ASSCL_SSRTSTA              (0x1   << 9  )
#define I2C0ASSCL_SSRTSTA_DIS          (0x0   << 9  )
#define I2C0ASSCL_SSRTSTA_EN           (0x1   << 9  )

/* I2C0ASSCL[MSRTSTA] - stretch timeout for master */
#define I2C0ASSCL_MSRTSTA_BBA          (*(volatile unsigned long *) 0x42060B20)
#define I2C0ASSCL_MSRTSTA_MSK          (0x1   << 8  )
#define I2C0ASSCL_MSRTSTA              (0x1   << 8  )
#define I2C0ASSCL_MSRTSTA_DIS          (0x0   << 8  )
#define I2C0ASSCL_MSRTSTA_EN           (0x1   << 8  )

/* I2C0ASSCL[SSTRCON] - automatic stretch mode for slave */
#define I2C0ASSCL_SSTRCON_MSK          (0xF   << 4  )

/* I2C0ASSCL[MSTRCON] - automatic stretch mode for master */
#define I2C0ASSCL_MSTRCON_MSK          (0xF   << 0  )

/* Reset Value for I2C1MCON*/
#define I2C1MCON_RVAL                  0x0 

/* I2C1MCON[PRESTOP_BUS_CLR] - Prestop Bus-Clear */
#define I2C1MCON_PRESTOP_BUS_CLR_BBA   (*(volatile unsigned long *) 0x42068034)
#define I2C1MCON_PRESTOP_BUS_CLR_MSK   (0x1   << 13 )
#define I2C1MCON_PRESTOP_BUS_CLR       (0x1   << 13 )
#define I2C1MCON_PRESTOP_BUS_CLR_DIS   (0x0   << 13 )
#define I2C1MCON_PRESTOP_BUS_CLR_EN    (0x1   << 13 )

/* I2C1MCON[BUS_CLR_EN] - Bus-Clear Enable */
#define I2C1MCON_BUS_CLR_EN_BBA        (*(volatile unsigned long *) 0x42068030)
#define I2C1MCON_BUS_CLR_EN_MSK        (0x1   << 12 )
#define I2C1MCON_BUS_CLR_EN            (0x1   << 12 )
#define I2C1MCON_BUS_CLR_EN_DIS        (0x0   << 12 )
#define I2C1MCON_BUS_CLR_EN_EN         (0x1   << 12 )

/* I2C1MCON[MTXDMA] - Enable master Tx DMA request */
#define I2C1MCON_MTXDMA_BBA            (*(volatile unsigned long *) 0x4206802C)
#define I2C1MCON_MTXDMA_MSK            (0x1   << 11 )
#define I2C1MCON_MTXDMA                (0x1   << 11 )
#define I2C1MCON_MTXDMA_DIS            (0x0   << 11 ) /* Disable DMA mode         */
#define I2C1MCON_MTXDMA_EN             (0x1   << 11 ) /* Enable I2C master DMA Tx requests. */

/* I2C1MCON[MRXDMA] - Enable master Rx DMA request */
#define I2C1MCON_MRXDMA_BBA            (*(volatile unsigned long *) 0x42068028)
#define I2C1MCON_MRXDMA_MSK            (0x1   << 10 )
#define I2C1MCON_MRXDMA                (0x1   << 10 )
#define I2C1MCON_MRXDMA_DIS            (0x0   << 10 ) /* Disable DMA mode         */
#define I2C1MCON_MRXDMA_EN             (0x1   << 10 ) /* Enable I2C master DMA Rx requests. */

/* I2C1MCON[MXMITDEC] - Decrement master TX FIFO status when a byte has been transmitted */
#define I2C1MCON_MXMITDEC_BBA          (*(volatile unsigned long *) 0x42068024)
#define I2C1MCON_MXMITDEC_MSK          (0x1   << 9  )
#define I2C1MCON_MXMITDEC              (0x1   << 9  )
#define I2C1MCON_MXMITDEC_DIS          (0x0   << 9  )
#define I2C1MCON_MXMITDEC_EN           (0x1   << 9  )

/* I2C1MCON[IENCMP] - Transaction completed (or stop detected) interrupt enable */
#define I2C1MCON_IENCMP_BBA            (*(volatile unsigned long *) 0x42068020)
#define I2C1MCON_IENCMP_MSK            (0x1   << 8  )
#define I2C1MCON_IENCMP                (0x1   << 8  )
#define I2C1MCON_IENCMP_DIS            (0x0   << 8  ) /* An interrupt is not generated when a STOP is detected. */
#define I2C1MCON_IENCMP_EN             (0x1   << 8  ) /* An interrupt is generated when a STOP is detected. */

