koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* I2C1MCON[IENACK] - ACK not received interrupt enable */
#define I2C1MCON_IENACK_BBA            (*(volatile unsigned long *) 0x4206801C)
#define I2C1MCON_IENACK_MSK            (0x1   << 7  )
#define I2C1MCON_IENACK                (0x1   << 7  )
#define I2C1MCON_IENACK_DIS            (0x0   << 7  ) /* ACK not received interrupt disable */
#define I2C1MCON_IENACK_EN             (0x1   << 7  ) /* ACK not received interrupt enable */

/* I2C1MCON[IENALOST] - Arbitration lost interrupt enable */
#define I2C1MCON_IENALOST_BBA          (*(volatile unsigned long *) 0x42068018)
#define I2C1MCON_IENALOST_MSK          (0x1   << 6  )
#define I2C1MCON_IENALOST              (0x1   << 6  )
#define I2C1MCON_IENALOST_DIS          (0x0   << 6  ) /* Arbitration lost interrupt disable */
#define I2C1MCON_IENALOST_EN           (0x1   << 6  ) /* Arbitration lost interrupt enable */

/* I2C1MCON[IENMTX] - Transmit request interrupt enable. */
#define I2C1MCON_IENMTX_BBA            (*(volatile unsigned long *) 0x42068014)
#define I2C1MCON_IENMTX_MSK            (0x1   << 5  )
#define I2C1MCON_IENMTX                (0x1   << 5  )
#define I2C1MCON_IENMTX_DIS            (0x0   << 5  ) /* Transmit request interrupt disable */
#define I2C1MCON_IENMTX_EN             (0x1   << 5  ) /* Transmit request interrupt enable */

/* I2C1MCON[IENMRX] - Receive request interrupt enable */
#define I2C1MCON_IENMRX_BBA            (*(volatile unsigned long *) 0x42068010)
#define I2C1MCON_IENMRX_MSK            (0x1   << 4  )
#define I2C1MCON_IENMRX                (0x1   << 4  )
#define I2C1MCON_IENMRX_DIS            (0x0   << 4  ) /* Receive request interrupt disable */
#define I2C1MCON_IENMRX_EN             (0x1   << 4  ) /* Receive request interrupt enable */

/* I2C1MCON[STRETCH] - Stretch SCL enable */
#define I2C1MCON_STRETCH_BBA           (*(volatile unsigned long *) 0x4206800C)
#define I2C1MCON_STRETCH_MSK           (0x1   << 3  )
#define I2C1MCON_STRETCH               (0x1   << 3  )
#define I2C1MCON_STRETCH_DIS           (0x0   << 3  ) /* Disable Clock stretching */
#define I2C1MCON_STRETCH_EN            (0x1   << 3  ) /* Setting this bit tells the device if SCL is 0 hold it at 0;. Or if SCL is 1 then when it next goes to 0 hold it at 0. */

/* I2C1MCON[LOOPBACK] - Internal loopback enable */
#define I2C1MCON_LOOPBACK_BBA          (*(volatile unsigned long *) 0x42068008)
#define I2C1MCON_LOOPBACK_MSK          (0x1   << 2  )
#define I2C1MCON_LOOPBACK              (0x1   << 2  )
#define I2C1MCON_LOOPBACK_DIS          (0x0   << 2  ) /* SCL and SDA out of the device are not muxed onto their corresponding inputs. */
#define I2C1MCON_LOOPBACK_EN           (0x1   << 2  ) /* SCL and SDA out of the device are muxed onto their corresponding inputs. */

/* I2C1MCON[COMPETE] - Start back-off disable */
#define I2C1MCON_COMPETE_BBA           (*(volatile unsigned long *) 0x42068004)
#define I2C1MCON_COMPETE_MSK           (0x1   << 1  )
#define I2C1MCON_COMPETE               (0x1   << 1  )
#define I2C1MCON_COMPETE_DIS           (0x0   << 1  )
#define I2C1MCON_COMPETE_EN            (0x1   << 1  )

/* I2C1MCON[MASEN] - Master enable */
#define I2C1MCON_MASEN_BBA             (*(volatile unsigned long *) 0x42068000)
#define I2C1MCON_MASEN_MSK             (0x1   << 0  )
#define I2C1MCON_MASEN                 (0x1   << 0  )
#define I2C1MCON_MASEN_DIS             (0x0   << 0  ) /* Master is disabled       */
#define I2C1MCON_MASEN_EN              (0x1   << 0  ) /* Master is enabled        */

/* Reset Value for I2C1MSTA*/
#define I2C1MSTA_RVAL                  0x6000 

/* I2C1MSTA[SCL_FILTERED] - State of SCL Line */
#define I2C1MSTA_SCL_FILTERED_BBA      (*(volatile unsigned long *) 0x420680B8)
#define I2C1MSTA_SCL_FILTERED_MSK      (0x1   << 14 )
#define I2C1MSTA_SCL_FILTERED          (0x1   << 14 )
#define I2C1MSTA_SCL_FILTERED_CLR      (0x0   << 14 )
#define I2C1MSTA_SCL_FILTERED_SET      (0x1   << 14 )

/* I2C1MSTA[SDA_FILTERED] - State of SDA Line */
#define I2C1MSTA_SDA_FILTERED_BBA      (*(volatile unsigned long *) 0x420680B4)
#define I2C1MSTA_SDA_FILTERED_MSK      (0x1   << 13 )
#define I2C1MSTA_SDA_FILTERED          (0x1   << 13 )
#define I2C1MSTA_SDA_FILTERED_CLR      (0x0   << 13 )
#define I2C1MSTA_SDA_FILTERED_SET      (0x1   << 13 )

/* I2C1MSTA[MTXUFLOW] - Master Transmit Underflow */
#define I2C1MSTA_MTXUFLOW_BBA          (*(volatile unsigned long *) 0x420680B0)
#define I2C1MSTA_MTXUFLOW_MSK          (0x1   << 12 )
#define I2C1MSTA_MTXUFLOW              (0x1   << 12 )
#define I2C1MSTA_MTXUFLOW_CLR          (0x0   << 12 )
#define I2C1MSTA_MTXUFLOW_SET          (0x1   << 12 )

/* I2C1MSTA[MSTOP] - STOP driven by this I2C Master */
#define I2C1MSTA_MSTOP_BBA             (*(volatile unsigned long *) 0x420680AC)
#define I2C1MSTA_MSTOP_MSK             (0x1   << 11 )
#define I2C1MSTA_MSTOP                 (0x1   << 11 )
#define I2C1MSTA_MSTOP_CLR             (0x0   << 11 )
#define I2C1MSTA_MSTOP_SET             (0x1   << 11 )

/* I2C1MSTA[LINEBUSY] - Line is busy */
#define I2C1MSTA_LINEBUSY_BBA          (*(volatile unsigned long *) 0x420680A8)
#define I2C1MSTA_LINEBUSY_MSK          (0x1   << 10 )
#define I2C1MSTA_LINEBUSY              (0x1   << 10 )
#define I2C1MSTA_LINEBUSY_CLR          (0x0   << 10 )
#define I2C1MSTA_LINEBUSY_SET          (0x1   << 10 )

/* I2C1MSTA[MRXOF] - Master Receive FIFO overflow */
#define I2C1MSTA_MRXOF_BBA             (*(volatile unsigned long *) 0x420680A4)
#define I2C1MSTA_MRXOF_MSK             (0x1   << 9  )
#define I2C1MSTA_MRXOF                 (0x1   << 9  )
#define I2C1MSTA_MRXOF_CLR             (0x0   << 9  )
#define I2C1MSTA_MRXOF_SET             (0x1   << 9  )

/* I2C1MSTA[TCOMP] - Transaction complete or stop detected */
#define I2C1MSTA_TCOMP_BBA             (*(volatile unsigned long *) 0x420680A0)
#define I2C1MSTA_TCOMP_MSK             (0x1   << 8  )
#define I2C1MSTA_TCOMP                 (0x1   << 8  )
#define I2C1MSTA_TCOMP_CLR             (0x0   << 8  )
#define I2C1MSTA_TCOMP_SET             (0x1   << 8  )

/* I2C1MSTA[NACKDATA] - ACK not received in response to data write */
#define I2C1MSTA_NACKDATA_BBA          (*(volatile unsigned long *) 0x4206809C)
#define I2C1MSTA_NACKDATA_MSK          (0x1   << 7  )
#define I2C1MSTA_NACKDATA              (0x1   << 7  )
#define I2C1MSTA_NACKDATA_CLR          (0x0   << 7  )
#define I2C1MSTA_NACKDATA_SET          (0x1   << 7  )

/* I2C1MSTA[MBUSY] - Master busy */
#define I2C1MSTA_MBUSY_BBA             (*(volatile unsigned long *) 0x42068098)
#define I2C1MSTA_MBUSY_MSK             (0x1   << 6  )
#define I2C1MSTA_MBUSY                 (0x1   << 6  )
#define I2C1MSTA_MBUSY_CLR             (0x0   << 6  )
#define I2C1MSTA_MBUSY_SET             (0x1   << 6  )

/* I2C1MSTA[ALOST] - Arbitration lost */
#define I2C1MSTA_ALOST_BBA             (*(volatile unsigned long *) 0x42068094)
#define I2C1MSTA_ALOST_MSK             (0x1   << 5  )
#define I2C1MSTA_ALOST                 (0x1   << 5  )
#define I2C1MSTA_ALOST_CLR             (0x0   << 5  )
#define I2C1MSTA_ALOST_SET             (0x1   << 5  )

/* I2C1MSTA[NACKADDR] - ACK not received in response to an address */
#define I2C1MSTA_NACKADDR_BBA          (*(volatile unsigned long *) 0x42068090)
#define I2C1MSTA_NACKADDR_MSK          (0x1   << 4  )
#define I2C1MSTA_NACKADDR              (0x1   << 4  )
#define I2C1MSTA_NACKADDR_CLR          (0x0   << 4  )
#define I2C1MSTA_NACKADDR_SET          (0x1   << 4  )

/* I2C1MSTA[MRXREQ] - Master Receive request */
#define I2C1MSTA_MRXREQ_BBA            (*(volatile unsigned long *) 0x4206808C)
#define I2C1MSTA_MRXREQ_MSK            (0x1   << 3  )
#define I2C1MSTA_MRXREQ                (0x1   << 3  )
#define I2C1MSTA_MRXREQ_CLR            (0x0   << 3  )
#define I2C1MSTA_MRXREQ_SET            (0x1   << 3  )

/* I2C1MSTA[MTXREQ] - Master Transmit request */
#define I2C1MSTA_MTXREQ_BBA            (*(volatile unsigned long *) 0x42068088)
#define I2C1MSTA_MTXREQ_MSK            (0x1   << 2  )
#define I2C1MSTA_MTXREQ                (0x1   << 2  )
#define I2C1MSTA_MTXREQ_CLR            (0x0   << 2  )
#define I2C1MSTA_MTXREQ_SET            (0x1   << 2  )

