koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* I2C1FSTA[MFLUSH] - Flush the master transmit FIFO */
#define I2C1FSTA_MFLUSH_BBA            (*(volatile unsigned long *) 0x420689A4)
#define I2C1FSTA_MFLUSH_MSK            (0x1   << 9  )
#define I2C1FSTA_MFLUSH                (0x1   << 9  )
#define I2C1FSTA_MFLUSH_DIS            (0x0   << 9  ) /* Clearing to 0 has no effect. */
#define I2C1FSTA_MFLUSH_EN             (0x1   << 9  ) /* Set to 1 to flush the master transmit FIFO. The master transmit FIFO will have to flushed if arbitration is lost or a slave responds with a NACK. */

/* I2C1FSTA[SFLUSH] - Flush the slave transmit FIFO */
#define I2C1FSTA_SFLUSH_BBA            (*(volatile unsigned long *) 0x420689A0)
#define I2C1FSTA_SFLUSH_MSK            (0x1   << 8  )
#define I2C1FSTA_SFLUSH                (0x1   << 8  )
#define I2C1FSTA_SFLUSH_DIS            (0x0   << 8  ) /* Clearing to 0 has no effect. */
#define I2C1FSTA_SFLUSH_EN             (0x1   << 8  ) /* Set to 1 to flush the slave transmit FIFO. */

/* I2C1FSTA[MRXFSTA] - Master receive FIFO status */
#define I2C1FSTA_MRXFSTA_MSK           (0x3   << 6  )
#define I2C1FSTA_MRXFSTA_EMPTY         (0x0   << 6  ) /* FIFO empty               */
#define I2C1FSTA_MRXFSTA_ONEBYTE       (0x1   << 6  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_MRXFSTA_TWOBYTES      (0x2   << 6  ) /* 2 bytes in the FIFO      */

/* I2C1FSTA[MTXFSTA] - Master transmit FIFO status */
#define I2C1FSTA_MTXFSTA_MSK           (0x3   << 4  )
#define I2C1FSTA_MTXFSTA_EMPTY         (0x0   << 4  ) /* FIFO empty               */
#define I2C1FSTA_MTXFSTA_ONEBYTE       (0x1   << 4  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_MTXFSTA_TWOBYTES      (0x2   << 4  ) /* 2 bytes in the FIFO      */

/* I2C1FSTA[SRXFSTA] - Slave receive FIFO status */
#define I2C1FSTA_SRXFSTA_MSK           (0x3   << 2  )
#define I2C1FSTA_SRXFSTA_EMPTY         (0x0   << 2  ) /* FIFO empty               */
#define I2C1FSTA_SRXFSTA_ONEBYTE       (0x1   << 2  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_SRXFSTA_TWOBYTES      (0x2   << 2  ) /* 2 bytes in the FIFO      */

/* I2C1FSTA[STXFSTA] - Slave transmit FIFO status */
#define I2C1FSTA_STXFSTA_MSK           (0x3   << 0  )
#define I2C1FSTA_STXFSTA_EMPTY         (0x0   << 0  ) /* FIFO empty               */
#define I2C1FSTA_STXFSTA_ONEBYTE       (0x1   << 0  ) /* 1 bytes in the FIFO      */
#define I2C1FSTA_STXFSTA_TWOBYTES      (0x2   << 0  ) /* 2 bytes in the FIFO      */

/* Reset Value for I2C1SHCON*/
#define I2C1SHCON_RVAL                 0x0 

/* I2C1SHCON[RESET] - Reset START STOP detect circuit */
#define I2C1SHCON_RESET_BBA            (*(volatile unsigned long *) 0x42068A00)
#define I2C1SHCON_RESET_MSK            (0x1   << 0  )
#define I2C1SHCON_RESET                (0x1   << 0  )
#define I2C1SHCON_RESET_DIS            (0x0   << 0  )
#define I2C1SHCON_RESET_EN             (0x1   << 0  )

/* Reset Value for I2C1ASSCL*/
#define I2C1ASSCL_RVAL                 0x0 

/* I2C1ASSCL[SSRTSTA] - stretch timeout for slave */
#define I2C1ASSCL_SSRTSTA_BBA          (*(volatile unsigned long *) 0x42068B24)
#define I2C1ASSCL_SSRTSTA_MSK          (0x1   << 9  )
#define I2C1ASSCL_SSRTSTA              (0x1   << 9  )
#define I2C1ASSCL_SSRTSTA_DIS          (0x0   << 9  )
#define I2C1ASSCL_SSRTSTA_EN           (0x1   << 9  )

/* I2C1ASSCL[MSRTSTA] - stretch timeout for master */
#define I2C1ASSCL_MSRTSTA_BBA          (*(volatile unsigned long *) 0x42068B20)
#define I2C1ASSCL_MSRTSTA_MSK          (0x1   << 8  )
#define I2C1ASSCL_MSRTSTA              (0x1   << 8  )
#define I2C1ASSCL_MSRTSTA_DIS          (0x0   << 8  )
#define I2C1ASSCL_MSRTSTA_EN           (0x1   << 8  )

/* I2C1ASSCL[SSTRCON] - automatic stretch mode for slave */
#define I2C1ASSCL_SSTRCON_MSK          (0xF   << 4  )

/* I2C1ASSCL[MSTRCON] - automatic stretch mode for master */
#define I2C1ASSCL_MSTRCON_MSK          (0xF   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        uart0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief uart0 (pADI_UART)
  */

typedef struct {                            /*!< pADI_UART Structure                    */
  
  union {
    __IO uint16_t  COMTX;                   /*!< Transmit holding register             */
    __IO uint16_t  COMRX;                   /*!< Receive buffer register               */
  } ;
  __I  uint16_t  RESERVED0;
  __IO uint16_t  COMIEN;                    /*!< Interrupt enable register             */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  COMIIR;                    /*!< Interrupt identification register     */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  COMLCR;                    /*!< Line control register                 */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  COMMCR;                    /*!< Modem control register                */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  COMLSR;                    /*!< Line status register                  */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  COMMSR;                    /*!< Modem status register                 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  COMSCR;                    /*!< Scratch buffer register               */
  __I  uint16_t  RESERVED7[3];
  __IO uint16_t  COMFBR;                    /*!< Fractional baud rate register         */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  COMDIV;                    /*!< Baud rate divider register            */
} ADI_UART_TypeDef;

/* Reset Value for COMTX*/
#define COMTX_RVAL                     0x0 

/* COMTX[THR] - Transmit Holding Register */
#define COMTX_THR_MSK                  (0xFF  << 0  )

/* Reset Value for COMRX*/
#define COMRX_RVAL                     0x0 

/* COMRX[RBR] - Receive Buffer Register */
#define COMRX_RBR_MSK                  (0xFF  << 0  )

/* Reset Value for COMIEN*/
#define COMIEN_RVAL                    0x0 

/* COMIEN[EDMAR] - DMA requests in receive mode */
#define COMIEN_EDMAR_BBA               (*(volatile unsigned long *) 0x420A0094)
#define COMIEN_EDMAR_MSK               (0x1   << 5  )
#define COMIEN_EDMAR                   (0x1   << 5  )
#define COMIEN_EDMAR_DIS               (0x0   << 5  ) /* DMA requests disabled    */
#define COMIEN_EDMAR_EN                (0x1   << 5  ) /* DMA requests enabled     */

/* COMIEN[EDMAT] - DMA requests in transmit mode */
#define COMIEN_EDMAT_BBA               (*(volatile unsigned long *) 0x420A0090)
#define COMIEN_EDMAT_MSK               (0x1   << 4  )
#define COMIEN_EDMAT                   (0x1   << 4  )
#define COMIEN_EDMAT_DIS               (0x0   << 4  ) /* DMA requests are disabled */
#define COMIEN_EDMAT_EN                (0x1   << 4  ) /* DMA requests are enabled */

/* COMIEN[EDSSI] - Modem status interrupt */
#define COMIEN_EDSSI_BBA               (*(volatile unsigned long *) 0x420A008C)
#define COMIEN_EDSSI_MSK               (0x1   << 3  )
#define COMIEN_EDSSI                   (0x1   << 3  )
#define COMIEN_EDSSI_DIS               (0x0   << 3  ) /* Interrupt disabled       */
#define COMIEN_EDSSI_EN                (0x1   << 3  ) /* Interrupt enabled        */

