koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* COMIEN[ELSI] - Rx status interrupt */
#define COMIEN_ELSI_BBA                (*(volatile unsigned long *) 0x420A0088)
#define COMIEN_ELSI_MSK                (0x1   << 2  )
#define COMIEN_ELSI                    (0x1   << 2  )
#define COMIEN_ELSI_DIS                (0x0   << 2  ) /* Interrupt disabled       */
#define COMIEN_ELSI_EN                 (0x1   << 2  ) /* Interrupt enabled        */

/* COMIEN[ETBEI] - Transmit buffer empty interrupt */
#define COMIEN_ETBEI_BBA               (*(volatile unsigned long *) 0x420A0084)
#define COMIEN_ETBEI_MSK               (0x1   << 1  )
#define COMIEN_ETBEI                   (0x1   << 1  )
#define COMIEN_ETBEI_DIS               (0x0   << 1  ) /* Interrupt disabled       */
#define COMIEN_ETBEI_EN                (0x1   << 1  ) /* Interrupt enabled        */

/* COMIEN[ERBFI] - Receive buffer full interrupt */
#define COMIEN_ERBFI_BBA               (*(volatile unsigned long *) 0x420A0080)
#define COMIEN_ERBFI_MSK               (0x1   << 0  )
#define COMIEN_ERBFI                   (0x1   << 0  )
#define COMIEN_ERBFI_DIS               (0x0   << 0  ) /* Interrupt disabled       */
#define COMIEN_ERBFI_EN                (0x1   << 0  ) /* Interrupt enabled        */

/* Reset Value for COMIIR*/
#define COMIIR_RVAL                    0x1 

/* COMIIR[STA] - Interrupt status */
#define COMIIR_STA_MSK                 (0x3   << 1  )
#define COMIIR_STA_MODEMSTATUS         (0x0   << 1  ) /* Modem status interrupt (Read COMMSR to clear) */
#define COMIIR_STA_TXBUFEMPTY          (0x1   << 1  ) /* Transmit buffer empty interrupt (Write to COMTX or read COMIIR to clear) */
#define COMIIR_STA_RXBUFFULL           (0x2   << 1  ) /* Receive buffer full interrupt (Read COMRX to clear) */
#define COMIIR_STA_RXLINESTATUS        (0x3   << 1  ) /* Receive line status interrupt (Read COMLSR to clear) */

/* COMIIR[NIRQ] - Interrupt flag */
#define COMIIR_NIRQ_BBA                (*(volatile unsigned long *) 0x420A0100)
#define COMIIR_NIRQ_MSK                (0x1   << 0  )
#define COMIIR_NIRQ                    (0x1   << 0  )
#define COMIIR_NIRQ_CLR                (0x0   << 0  ) /* Interrupt occurred. Source of interrupt indicated in the STA bits. */
#define COMIIR_NIRQ_SET                (0x1   << 0  ) /* No interrupt occurred.   */

/* Reset Value for COMLCR*/
#define COMLCR_RVAL                    0x0 

/* COMLCR[BRK] - Set Break */
#define COMLCR_BRK_BBA                 (*(volatile unsigned long *) 0x420A0198)
#define COMLCR_BRK_MSK                 (0x1   << 6  )
#define COMLCR_BRK                     (0x1   << 6  )
#define COMLCR_BRK_DIS                 (0x0   << 6  ) /* Force TxD to 0           */
#define COMLCR_BRK_EN                  (0x1   << 6  ) /* Normal TxD operation     */

/* COMLCR[SP] - Stick Parity */
#define COMLCR_SP_BBA                  (*(volatile unsigned long *) 0x420A0194)
#define COMLCR_SP_MSK                  (0x1   << 5  )
#define COMLCR_SP                      (0x1   << 5  )
#define COMLCR_SP_DIS                  (0x0   << 5  ) /* Parity will not be forced based on EPS and PEN */
#define COMLCR_SP_EN                   (0x1   << 5  ) /* Parity forced based on EPS and PEN */

/* COMLCR[EPS] - Parity Select */
#define COMLCR_EPS_BBA                 (*(volatile unsigned long *) 0x420A0190)
#define COMLCR_EPS_MSK                 (0x1   << 4  )
#define COMLCR_EPS                     (0x1   << 4  )
#define COMLCR_EPS_ODD                 (0x0   << 4  ) /* Odd parity will be transmitted and checked */
#define COMLCR_EPS_EVEN                (0x1   << 4  ) /* Even parity will be transmitted and checked */

/* COMLCR[PEN] - Parity Enable */
#define COMLCR_PEN_BBA                 (*(volatile unsigned long *) 0x420A018C)
#define COMLCR_PEN_MSK                 (0x1   << 3  )
#define COMLCR_PEN                     (0x1   << 3  )
#define COMLCR_PEN_DIS                 (0x0   << 3  ) /* Parity will not be transmitted or checked */
#define COMLCR_PEN_EN                  (0x1   << 3  ) /* Parity will be transmitted and checked */

/* COMLCR[STOP] - Stop Bit */
#define COMLCR_STOP_BBA                (*(volatile unsigned long *) 0x420A0188)
#define COMLCR_STOP_MSK                (0x1   << 2  )
#define COMLCR_STOP                    (0x1   << 2  )
#define COMLCR_STOP_DIS                (0x0   << 2  ) /* Send 1 stop bit regardless of the word length (WLS). */
#define COMLCR_STOP_EN                 (0x1   << 2  ) /* Send a number of stop bits based on the word length. Transmit 1.5 stop bits if the word length is 5 bits (WLS = 00), or 2 stop bits if the word length is 6 (WLS = 01), 7 (WLS = 10), or 8 bits (WLS = 11). */

/* COMLCR[WLS] - Word Length Select */
#define COMLCR_WLS_MSK                 (0x3   << 0  )
#define COMLCR_WLS_FIVEBITS            (0x0   << 0  ) /* 5 bits                   */
#define COMLCR_WLS_SIXBITS             (0x1   << 0  ) /* 6 bits                   */
#define COMLCR_WLS_SEVENBITS           (0x2   << 0  ) /* 7 bits                   */
#define COMLCR_WLS_EIGHTBITS           (0x3   << 0  ) /* 8 bits                   */

/* Reset Value for COMMCR*/
#define COMMCR_RVAL                    0x0 

/* COMMCR[LOOPBACK] - Loopback mode */
#define COMMCR_LOOPBACK_BBA            (*(volatile unsigned long *) 0x420A0210)
#define COMMCR_LOOPBACK_MSK            (0x1   << 4  )
#define COMMCR_LOOPBACK                (0x1   << 4  )
#define COMMCR_LOOPBACK_DIS            (0x0   << 4  ) /* Normal operation - loopback disabled */
#define COMMCR_LOOPBACK_EN             (0x1   << 4  ) /* Loopback enabled         */

/* COMMCR[OUT2] - Output 2 */
#define COMMCR_OUT2_BBA                (*(volatile unsigned long *) 0x420A020C)
#define COMMCR_OUT2_MSK                (0x1   << 3  )
#define COMMCR_OUT2                    (0x1   << 3  )
#define COMMCR_OUT2_HIGH               (0x0   << 3  ) /* Force OUT2 to a logic 1  */
#define COMMCR_OUT2_LOW                (0x1   << 3  ) /* Force OUT2 to a logic 0  */

/* COMMCR[OUT1] - Output 1 */
#define COMMCR_OUT1_BBA                (*(volatile unsigned long *) 0x420A0208)
#define COMMCR_OUT1_MSK                (0x1   << 2  )
#define COMMCR_OUT1                    (0x1   << 2  )
#define COMMCR_OUT1_HIGH               (0x0   << 2  ) /* Force OUT1 to a logic 1  */
#define COMMCR_OUT1_LOW                (0x1   << 2  ) /* Force OUT1 to a logic 0  */

/* COMMCR[RTS] - Request to send */
#define COMMCR_RTS_BBA                 (*(volatile unsigned long *) 0x420A0204)
#define COMMCR_RTS_MSK                 (0x1   << 1  )
#define COMMCR_RTS                     (0x1   << 1  )
#define COMMCR_RTS_HIGH                (0x0   << 1  ) /* Force RTS to a logic 1   */
#define COMMCR_RTS_LOW                 (0x1   << 1  ) /* Force RTS to a logic 0   */

