koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* COMMCR[DTR] - Data Terminal Ready */
#define COMMCR_DTR_BBA                 (*(volatile unsigned long *) 0x420A0200)
#define COMMCR_DTR_MSK                 (0x1   << 0  )
#define COMMCR_DTR                     (0x1   << 0  )
#define COMMCR_DTR_HIGH                (0x0   << 0  ) /* Force DTR to a logic 1   */
#define COMMCR_DTR_LOW                 (0x1   << 0  ) /* Force DTR to a logic 0   */

/* Reset Value for COMLSR*/
#define COMLSR_RVAL                    0x60 

/* COMLSR[TEMT] - COMTX and shift register empty status */
#define COMLSR_TEMT_BBA                (*(volatile unsigned long *) 0x420A0298)
#define COMLSR_TEMT_MSK                (0x1   << 6  )
#define COMLSR_TEMT                    (0x1   << 6  )
#define COMLSR_TEMT_CLR                (0x0   << 6  ) /* COMTX has been written to and contains data to be transmitted. Care should be taken not to overwrite its value. */
#define COMLSR_TEMT_SET                (0x1   << 6  ) /* COMTX and the transmit shift register are empty and it is safe to write new data to COMTX. Data has been transmitted. */

/* COMLSR[THRE] - COMTX empty */
#define COMLSR_THRE_BBA                (*(volatile unsigned long *) 0x420A0294)
#define COMLSR_THRE_MSK                (0x1   << 5  )
#define COMLSR_THRE                    (0x1   << 5  )
#define COMLSR_THRE_CLR                (0x0   << 5  ) /* COMTX has been written to and contains data to be transmitted. Care should be taken not to overwrite its value. */
#define COMLSR_THRE_SET                (0x1   << 5  ) /* COMTX is empty and it is safe to write new data to COMTX. The previous data may not have been transmitted yet and can still be present in the shift register. */

/* COMLSR[BI] - Break indicator */
#define COMLSR_BI_BBA                  (*(volatile unsigned long *) 0x420A0290)
#define COMLSR_BI_MSK                  (0x1   << 4  )
#define COMLSR_BI                      (0x1   << 4  )
#define COMLSR_BI_CLR                  (0x0   << 4  ) /* SIN was not detected to be longer than the maximum word length. */
#define COMLSR_BI_SET                  (0x1   << 4  ) /* SIN was held low for more than the maximum word length. */

/* COMLSR[FE] - Framing error */
#define COMLSR_FE_BBA                  (*(volatile unsigned long *) 0x420A028C)
#define COMLSR_FE_MSK                  (0x1   << 3  )
#define COMLSR_FE                      (0x1   << 3  )
#define COMLSR_FE_CLR                  (0x0   << 3  ) /* No invalid Stop bit was detected. */
#define COMLSR_FE_SET                  (0x1   << 3  ) /* An invalid Stop bit was detected on a received word. */

/* COMLSR[PE] - Parity error */
#define COMLSR_PE_BBA                  (*(volatile unsigned long *) 0x420A0288)
#define COMLSR_PE_MSK                  (0x1   << 2  )
#define COMLSR_PE                      (0x1   << 2  )
#define COMLSR_PE_CLR                  (0x0   << 2  ) /* No parity error was detected */
#define COMLSR_PE_SET                  (0x1   << 2  ) /* A parity error occurred on a received word. */

/* COMLSR[OE] - Overrun error */
#define COMLSR_OE_BBA                  (*(volatile unsigned long *) 0x420A0284)
#define COMLSR_OE_MSK                  (0x1   << 1  )
#define COMLSR_OE                      (0x1   << 1  )
#define COMLSR_OE_CLR                  (0x0   << 1  ) /* Receive data has not been overwritten */
#define COMLSR_OE_SET                  (0x1   << 1  ) /* Receive data was overwritten by new data before COMRX was read. */

/* COMLSR[DR] - Data ready */
#define COMLSR_DR_BBA                  (*(volatile unsigned long *) 0x420A0280)
#define COMLSR_DR_MSK                  (0x1   << 0  )
#define COMLSR_DR                      (0x1   << 0  )
#define COMLSR_DR_CLR                  (0x0   << 0  ) /* COMRX does not contain new receive data. */
#define COMLSR_DR_SET                  (0x1   << 0  ) /* COMRX contains receive data that should be read. */

/* Reset Value for COMMSR*/
#define COMMSR_RVAL                    0x0 

/* COMMSR[DCD] - Data Carrier Detect */
#define COMMSR_DCD_BBA                 (*(volatile unsigned long *) 0x420A031C)
#define COMMSR_DCD_MSK                 (0x1   << 7  )
#define COMMSR_DCD                     (0x1   << 7  )
#define COMMSR_DCD_DIS                 (0x0   << 7  ) /* DCD is currently logic high */
#define COMMSR_DCD_EN                  (0x1   << 7  ) /* DCD is currently logic low */

/* COMMSR[RI] - Ring Indicator */
#define COMMSR_RI_BBA                  (*(volatile unsigned long *) 0x420A0318)
#define COMMSR_RI_MSK                  (0x1   << 6  )
#define COMMSR_RI                      (0x1   << 6  )
#define COMMSR_RI_DIS                  (0x0   << 6  ) /* RI is currently logic high */
#define COMMSR_RI_EN                   (0x1   << 6  ) /* RI is currently logic low */

/* COMMSR[DSR] - Data Set Ready */
#define COMMSR_DSR_BBA                 (*(volatile unsigned long *) 0x420A0314)
#define COMMSR_DSR_MSK                 (0x1   << 5  )
#define COMMSR_DSR                     (0x1   << 5  )
#define COMMSR_DSR_DIS                 (0x0   << 5  ) /* DSR is currently logic high */
#define COMMSR_DSR_EN                  (0x1   << 5  ) /* DSR is currently logic low */

/* COMMSR[CTS] - Clear To Send */
#define COMMSR_CTS_BBA                 (*(volatile unsigned long *) 0x420A0310)
#define COMMSR_CTS_MSK                 (0x1   << 4  )
#define COMMSR_CTS                     (0x1   << 4  )
#define COMMSR_CTS_DIS                 (0x0   << 4  ) /* CTS is currently logic high */
#define COMMSR_CTS_EN                  (0x1   << 4  ) /* CTS is currently logic low */

/* COMMSR[DDCD] - Delta DCD */
#define COMMSR_DDCD_BBA                (*(volatile unsigned long *) 0x420A030C)
#define COMMSR_DDCD_MSK                (0x1   << 3  )
#define COMMSR_DDCD                    (0x1   << 3  )
#define COMMSR_DDCD_DIS                (0x0   << 3  ) /* DCD has not changed state since COMMSR was last read */
#define COMMSR_DDCD_EN                 (0x1   << 3  ) /* DCD changed state since COMMSR last read */

/* COMMSR[TERI] - Trailing Edge RI */
#define COMMSR_TERI_BBA                (*(volatile unsigned long *) 0x420A0308)
#define COMMSR_TERI_MSK                (0x1   << 2  )
#define COMMSR_TERI                    (0x1   << 2  )
#define COMMSR_TERI_DIS                (0x0   << 2  ) /* RI has not changed from 0 to 1 since COMMSR last read */
#define COMMSR_TERI_EN                 (0x1   << 2  ) /* RI changed from 0 to 1 since COMMSR last read */

/* COMMSR[DDSR] - Delta DSR */
#define COMMSR_DDSR_BBA                (*(volatile unsigned long *) 0x420A0304)
#define COMMSR_DDSR_MSK                (0x1   << 1  )
#define COMMSR_DDSR                    (0x1   << 1  )
#define COMMSR_DDSR_DIS                (0x0   << 1  ) /* DSR has not changed state since COMMSR was last read */
#define COMMSR_DDSR_EN                 (0x1   << 1  ) /* DSR changed state since COMMSR last read */

/* COMMSR[DCTS] - Delta CTS */
#define COMMSR_DCTS_BBA                (*(volatile unsigned long *) 0x420A0300)
#define COMMSR_DCTS_MSK                (0x1   << 0  )
#define COMMSR_DCTS                    (0x1   << 0  )
#define COMMSR_DCTS_DIS                (0x0   << 0  ) /* CTS has not changed state since COMMSR was last read */
#define COMMSR_DCTS_EN                 (0x1   << 0  ) /* CTS changed state since COMMSR last read */

/* Reset Value for COMSCR*/
#define COMSCR_RVAL                    0x0 

/* COMSCR[SCR] - Scratch */
#define COMSCR_SCR_MSK                 (0xFF  << 0  )

/* Reset Value for COMFBR*/
#define COMFBR_RVAL                    0x0 

/* COMFBR[FBEN] - Fractional baud rate generator enable */
#define COMFBR_FBEN_BBA                (*(volatile unsigned long *) 0x420A04BC)
#define COMFBR_FBEN_MSK                (0x1   << 15 )
#define COMFBR_FBEN                    (0x1   << 15 )
#define COMFBR_FBEN_DIS                (0x0   << 15 )
#define COMFBR_FBEN_EN                 (0x1   << 15 )

