koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* PLA_ELEM[TBL] - bit 4,3,2,1 configures output for {mux2_out, mux3_out} = 11,10,01,00 respectively */
#define PLA_ELEM_TBL_MSK               (0xF   << 1  )
#define PLA_ELEM_TBL_LOW               (0x0   << 1  ) /* 0.                       */
#define PLA_ELEM_TBL_NOR               (0x1   << 1  ) /* NOR.                     */
#define PLA_ELEM_TBL_BANDNOTA          (0x2   << 1  ) /* B and not A.             */
#define PLA_ELEM_TBL_NOTA              (0x3   << 1  ) /* NOT A.                   */
#define PLA_ELEM_TBL_AANDNOTB          (0x4   << 1  ) /* A and not B.             */
#define PLA_ELEM_TBL_NOTB              (0x5   << 1  ) /* Not B.                   */
#define PLA_ELEM_TBL_EXOR              (0x6   << 1  ) /* EXOR.                    */
#define PLA_ELEM_TBL_NAND              (0x7   << 1  ) /* NAND.                    */
#define PLA_ELEM_TBL_AND               (0x8   << 1  ) /* AND.                     */
#define PLA_ELEM_TBL_EXNOR             (0x9   << 1  ) /* EXNOR.                   */
#define PLA_ELEM_TBL_B                 (0xA   << 1  ) /* B.                       */
#define PLA_ELEM_TBL_BORNOTA           (0xB   << 1  ) /* B or not A.              */
#define PLA_ELEM_TBL_A                 (0xC   << 1  ) /* A.                       */
#define PLA_ELEM_TBL_AORNOTB           (0xD   << 1  ) /* A or not B.              */
#define PLA_ELEM_TBL_OR                (0xE   << 1  ) /* OR                       */
#define PLA_ELEM_TBL_HIGH              (0xF   << 1  ) /* 1.                       */

/* PLA_ELEM[MUX4] - Select or bypass flip-flop output */
#define PLA_ELEM_MUX4_BBA              (*(volatile unsigned long *) 0x420B0000)
#define PLA_ELEM_MUX4_MSK              (0x1   << 0  )
#define PLA_ELEM_MUX4                  (0x1   << 0  )
#define PLA_ELEM_MUX4_FF               (0x0   << 0  ) /* FF output                */
#define PLA_ELEM_MUX4_BYPASS           (0x1   << 0  ) /* Bypass output            */

/* Reset Value for PLA_CLK*/
#define PLA_CLK_RVAL                   0x0 

/* PLA_CLK[BLOCK3] - Clock select for Block 3 */
#define PLA_CLK_BLOCK3_MSK             (0x7   << 12 )
#define PLA_CLK_BLOCK3_P03             (0x0   << 12 ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK3_P11             (0x1   << 12 ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK3_P20             (0x2   << 12 ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK3_HCLK            (0x3   << 12 ) /* HCLK                     */
#define PLA_CLK_BLOCK3_MOSC            (0x4   << 12 ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK3_T0              (0x5   << 12 ) /* Timer 0                  */
#define PLA_CLK_BLOCK3_T2              (0x6   << 12 ) /* Timer 2                  */
#define PLA_CLK_BLOCK3_KOSC            (0x7   << 12 ) /* KOSC (32 kHz)            */

/* PLA_CLK[BLOCK2] - Clock select for Block 2 */
#define PLA_CLK_BLOCK2_MSK             (0x7   << 8  )
#define PLA_CLK_BLOCK2_P03             (0x0   << 8  ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK2_P11             (0x1   << 8  ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK2_P20             (0x2   << 8  ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK2_HCLK            (0x3   << 8  ) /* HCLK                     */
#define PLA_CLK_BLOCK2_MOSC            (0x4   << 8  ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK2_T0              (0x5   << 8  ) /* Timer 0                  */
#define PLA_CLK_BLOCK2_T2              (0x6   << 8  ) /* Timer 2                  */
#define PLA_CLK_BLOCK2_KOSC            (0x7   << 8  ) /* KOSC (32 kHz)            */

/* PLA_CLK[BLOCK1] - Clock select for Block 1 */
#define PLA_CLK_BLOCK1_MSK             (0x7   << 4  )
#define PLA_CLK_BLOCK1_P03             (0x0   << 4  ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK1_P11             (0x1   << 4  ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK1_P20             (0x2   << 4  ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK1_HCLK            (0x3   << 4  ) /* HCLK                     */
#define PLA_CLK_BLOCK1_MOSC            (0x4   << 4  ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK1_T0              (0x5   << 4  ) /* Timer 0                  */
#define PLA_CLK_BLOCK1_T2              (0x6   << 4  ) /* Timer 2                  */
#define PLA_CLK_BLOCK1_KOSC            (0x7   << 4  ) /* KOSC (32 kHz)            */

/* PLA_CLK[BLOCK0] - Clock select for Block 0 */
#define PLA_CLK_BLOCK0_MSK             (0x7   << 0  )
#define PLA_CLK_BLOCK0_P03             (0x0   << 0  ) /* GPIO clock on P0.3       */
#define PLA_CLK_BLOCK0_P11             (0x1   << 0  ) /* GPIO clock on P1.1       */
#define PLA_CLK_BLOCK0_P20             (0x2   << 0  ) /* GPIO clock on P2.0       */
#define PLA_CLK_BLOCK0_HCLK            (0x3   << 0  ) /* HCLK                     */
#define PLA_CLK_BLOCK0_MOSC            (0x4   << 0  ) /* MOSC (16 MHz)            */
#define PLA_CLK_BLOCK0_T0              (0x5   << 0  ) /* Timer 0                  */
#define PLA_CLK_BLOCK0_T2              (0x6   << 0  ) /* Timer 2                  */
#define PLA_CLK_BLOCK0_KOSC            (0x7   << 0  ) /* KOSC (32 kHz)            */

/* Reset Value for PLA_IRQ0*/
#define PLA_IRQ0_RVAL                  0x0 

/* PLA_IRQ0[irq1_en] - IRQ1 enable */
#define PLA_IRQ0_irq1_en_BBA           (*(volatile unsigned long *) 0x420B10B0)
#define PLA_IRQ0_irq1_en_MSK           (0x1   << 12 )
#define PLA_IRQ0_irq1_en               (0x1   << 12 )
#define PLA_IRQ0_irq1_en_DIS           (0x0   << 12 ) /* disable IRQ1 interrupt   */
#define PLA_IRQ0_irq1_en_EN            (0x1   << 12 ) /* enable IRQ1 interrupt    */

/* PLA_IRQ0[irq1_src] - IRQ1 source select (Elements 0-15). 4-bit value corresponds to element number (e.g. 1011 selects Element 11). */
#define PLA_IRQ0_irq1_src_MSK          (0xF   << 8  )

/* PLA_IRQ0[irq0_en] - IRQ0 enable */
#define PLA_IRQ0_irq0_en_BBA           (*(volatile unsigned long *) 0x420B1090)
#define PLA_IRQ0_irq0_en_MSK           (0x1   << 4  )
#define PLA_IRQ0_irq0_en               (0x1   << 4  )
#define PLA_IRQ0_irq0_en_DIS           (0x0   << 4  ) /* disable IRQ0 interrupt   */
#define PLA_IRQ0_irq0_en_EN            (0x1   << 4  ) /* enable IRQ0 interrupt    */

/* PLA_IRQ0[irq0_src] - IRQ0 source select (Elements 0-15). 4-bit value corresponds to element number (e.g. 1011 selects Element 11). */
#define PLA_IRQ0_irq0_src_MSK          (0xF   << 0  )

/* Reset Value for PLA_IRQ1*/
#define PLA_IRQ1_RVAL                  0x0 

