koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* PLA_IRQ1[irq3_en] - IRQ3 enable */
#define PLA_IRQ1_irq3_en_BBA           (*(volatile unsigned long *) 0x420B1130)
#define PLA_IRQ1_irq3_en_MSK           (0x1   << 12 )
#define PLA_IRQ1_irq3_en               (0x1   << 12 )
#define PLA_IRQ1_irq3_en_DIS           (0x0   << 12 ) /* disable IRQ3 interrupt   */
#define PLA_IRQ1_irq3_en_EN            (0x1   << 12 ) /* enable IRQ3 interrupt    */

/* PLA_IRQ1[irq3_src] - IRQ3 source select (Elements 16-31) Element number corresponds to 4-bit value + 16 (e.g. 1011 selects Element 27). */
#define PLA_IRQ1_irq3_src_MSK          (0xF   << 8  )

/* PLA_IRQ1[irq2_en] - IRQ2 enable */
#define PLA_IRQ1_irq2_en_BBA           (*(volatile unsigned long *) 0x420B1110)
#define PLA_IRQ1_irq2_en_MSK           (0x1   << 4  )
#define PLA_IRQ1_irq2_en               (0x1   << 4  )
#define PLA_IRQ1_irq2_en_DIS           (0x0   << 4  ) /* disable IRQ2 interrupt   */
#define PLA_IRQ1_irq2_en_EN            (0x1   << 4  ) /* enable IRQ2 interrupt    */

/* PLA_IRQ1[irq2_src] - IRQ2 source select (Elements 16-31). Element number corresponds to 4-bit value + 16 (e.g. 1011 selects Element 27). */
#define PLA_IRQ1_irq2_src_MSK          (0xF   << 0  )

/* Reset Value for PLA_ADC*/
#define PLA_ADC_RVAL                   0x0 

/* PLA_ADC[convst_en] - Bit to enable ADC start convert from PLA */
#define PLA_ADC_convst_en_BBA          (*(volatile unsigned long *) 0x420B1194)
#define PLA_ADC_convst_en_MSK          (0x1   << 5  )
#define PLA_ADC_convst_en              (0x1   << 5  )

/* PLA_ADC[convst_src] - Element for ADC start convert source. The binary value corresponds to the element number. For example Element 23 is 10111 */
#define PLA_ADC_convst_src_MSK         (0x1F  << 0  )

/* Reset Value for PLA_DIN0*/
#define PLA_DIN0_RVAL                  0x0 

/* PLA_DIN0[DIN] -  */
#define PLA_DIN0_DIN_MSK               (0xFFFF << 0  )

/* Reset Value for PLA_DOUT0*/
#define PLA_DOUT0_RVAL                 0x0 

/* PLA_DOUT0[E15] - Output bit from Element 15 */
#define PLA_DOUT0_E15_BBA              (*(volatile unsigned long *) 0x420B133C)
#define PLA_DOUT0_E15_MSK              (0x1   << 15 )
#define PLA_DOUT0_E15                  (0x1   << 15 )
#define PLA_DOUT0_E15_CLR              (0x0   << 15 )
#define PLA_DOUT0_E15_SET              (0x1   << 15 )

/* PLA_DOUT0[E14] - Output bit from Element 14 */
#define PLA_DOUT0_E14_BBA              (*(volatile unsigned long *) 0x420B1338)
#define PLA_DOUT0_E14_MSK              (0x1   << 14 )
#define PLA_DOUT0_E14                  (0x1   << 14 )
#define PLA_DOUT0_E14_CLR              (0x0   << 14 )
#define PLA_DOUT0_E14_SET              (0x1   << 14 )

/* PLA_DOUT0[E13] - Output bit from Element 13 */
#define PLA_DOUT0_E13_BBA              (*(volatile unsigned long *) 0x420B1334)
#define PLA_DOUT0_E13_MSK              (0x1   << 13 )
#define PLA_DOUT0_E13                  (0x1   << 13 )
#define PLA_DOUT0_E13_CLR              (0x0   << 13 )
#define PLA_DOUT0_E13_SET              (0x1   << 13 )

/* PLA_DOUT0[E12] - Output bit from Element 12 */
#define PLA_DOUT0_E12_BBA              (*(volatile unsigned long *) 0x420B1330)
#define PLA_DOUT0_E12_MSK              (0x1   << 12 )
#define PLA_DOUT0_E12                  (0x1   << 12 )
#define PLA_DOUT0_E12_CLR              (0x0   << 12 )
#define PLA_DOUT0_E12_SET              (0x1   << 12 )

/* PLA_DOUT0[E11] - Output bit from Element 11 */
#define PLA_DOUT0_E11_BBA              (*(volatile unsigned long *) 0x420B132C)
#define PLA_DOUT0_E11_MSK              (0x1   << 11 )
#define PLA_DOUT0_E11                  (0x1   << 11 )
#define PLA_DOUT0_E11_CLR              (0x0   << 11 )
#define PLA_DOUT0_E11_SET              (0x1   << 11 )

/* PLA_DOUT0[E10] - Output bit from Element 10 */
#define PLA_DOUT0_E10_BBA              (*(volatile unsigned long *) 0x420B1328)
#define PLA_DOUT0_E10_MSK              (0x1   << 10 )
#define PLA_DOUT0_E10                  (0x1   << 10 )
#define PLA_DOUT0_E10_CLR              (0x0   << 10 )
#define PLA_DOUT0_E10_SET              (0x1   << 10 )

/* PLA_DOUT0[E9] - Output bit from Element 9 */
#define PLA_DOUT0_E9_BBA               (*(volatile unsigned long *) 0x420B1324)
#define PLA_DOUT0_E9_MSK               (0x1   << 9  )
#define PLA_DOUT0_E9                   (0x1   << 9  )
#define PLA_DOUT0_E9_CLR               (0x0   << 9  )
#define PLA_DOUT0_E9_SET               (0x1   << 9  )

/* PLA_DOUT0[E8] - Output bit from Element 8 */
#define PLA_DOUT0_E8_BBA               (*(volatile unsigned long *) 0x420B1320)
#define PLA_DOUT0_E8_MSK               (0x1   << 8  )
#define PLA_DOUT0_E8                   (0x1   << 8  )
#define PLA_DOUT0_E8_CLR               (0x0   << 8  )
#define PLA_DOUT0_E8_SET               (0x1   << 8  )

/* PLA_DOUT0[E7] - Output bit from Element 7 */
#define PLA_DOUT0_E7_BBA               (*(volatile unsigned long *) 0x420B131C)
#define PLA_DOUT0_E7_MSK               (0x1   << 7  )
#define PLA_DOUT0_E7                   (0x1   << 7  )
#define PLA_DOUT0_E7_CLR               (0x0   << 7  )
#define PLA_DOUT0_E7_SET               (0x1   << 7  )

/* PLA_DOUT0[E6] - Output bit from Element 6 */
#define PLA_DOUT0_E6_BBA               (*(volatile unsigned long *) 0x420B1318)
#define PLA_DOUT0_E6_MSK               (0x1   << 6  )
#define PLA_DOUT0_E6                   (0x1   << 6  )
#define PLA_DOUT0_E6_CLR               (0x0   << 6  )
#define PLA_DOUT0_E6_SET               (0x1   << 6  )

/* PLA_DOUT0[E5] - Output bit from Element 5 */
#define PLA_DOUT0_E5_BBA               (*(volatile unsigned long *) 0x420B1314)
#define PLA_DOUT0_E5_MSK               (0x1   << 5  )
#define PLA_DOUT0_E5                   (0x1   << 5  )
#define PLA_DOUT0_E5_CLR               (0x0   << 5  )
#define PLA_DOUT0_E5_SET               (0x1   << 5  )

/* PLA_DOUT0[E4] - Output bit from Element 4 */
#define PLA_DOUT0_E4_BBA               (*(volatile unsigned long *) 0x420B1310)
#define PLA_DOUT0_E4_MSK               (0x1   << 4  )
#define PLA_DOUT0_E4                   (0x1   << 4  )
#define PLA_DOUT0_E4_CLR               (0x0   << 4  )
#define PLA_DOUT0_E4_SET               (0x1   << 4  )

/* PLA_DOUT0[E3] - Output bit from Element 3 */
#define PLA_DOUT0_E3_BBA               (*(volatile unsigned long *) 0x420B130C)
#define PLA_DOUT0_E3_MSK               (0x1   << 3  )
#define PLA_DOUT0_E3                   (0x1   << 3  )
#define PLA_DOUT0_E3_CLR               (0x0   << 3  )
#define PLA_DOUT0_E3_SET               (0x1   << 3  )

