koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* FEEFLADR[FLAddr] - Memory mapped address for the flash location */
#define FEEFLADR_FLAddr_MSK            (0xFFFF << 3  )

/* Reset Value for FEEFLDATA0*/
#define FEEFLDATA0_RVAL                0x0 

/* FEEFLDATA0[FLDATA0] - FLDATA0 forms the lower 32 bit of 64 bit data to be written to flash */
#define FEEFLDATA0_FLDATA0_MSK         (0xFFFFFFFF << 0  )

/* Reset Value for FEEFLDATA1*/
#define FEEFLDATA1_RVAL                0x0 

/* FEEFLDATA1[FLDATA1] - FLDATA1 forms the upper 32 bit of 64 bit data to be written to flash */
#define FEEFLDATA1_FLDATA1_MSK         (0xFFFFFFFF << 0  )

/* Reset Value for FEEADR0*/
#define FEEADR0_RVAL                   0x0 

/* FEEADR0[PageAddr0] - Used by SIGN and PAGEERASE commands for specifying page address. See the description of these commands in FEECMD */
#define FEEADR0_PageAddr0_MSK          (0xFF  << 11 )

/* Reset Value for FEEADR1*/
#define FEEADR1_RVAL                   0x0 

/* FEEADR1[PageAddr1] - Used by SIGN command for specifying the end page address. See description of this command in FEECMD */
#define FEEADR1_PageAddr1_MSK          (0xFF  << 11 )

/* Reset Value for FEEKEY*/
#define FEEKEY_RVAL                    0x0 

/* FEEKEY[KEY] - Enter 0xF123F456 to allow key protected operations. Returns 0x0 if read. */
#define FEEKEY_KEY_MSK                 (0xFFFFFFFF << 0  )

/* Reset Value for FEEPRO0*/
#define FEEPRO0_RVAL                   0xFFFFFFFF 

/* FEEPRO0[WrProt0] - Write protection for flash0 - 32 bits. */
#define FEEPRO0_WrProt0_MSK            (0xFFFFFFFF << 0  )

/* Reset Value for FEEPRO1*/
#define FEEPRO1_RVAL                   0xFFFFFFFF 

/* FEEPRO1[WrProt1] - Write protection for flash1 - 32 bits. */
#define FEEPRO1_WrProt1_MSK            (0xFFFFFFFF << 0  )

/* Reset Value for FEESIG*/
#define FEESIG_RVAL                    0x0 

/* FEESIG[SIGN] - 24 bit signature. */
#define FEESIG_SIGN_MSK                (0xFFFFFF << 0  )

/* Reset Value for FEECON1*/
#define FEECON1_RVAL                   0x1 

/* FEECON1[MDIO] - MDIO mode */
#define FEECON1_MDIO_BBA               (*(volatile unsigned long *) 0x42300710)
#define FEECON1_MDIO_MSK               (0x1   << 4  )
#define FEECON1_MDIO                   (0x1   << 4  )
#define FEECON1_MDIO_DIS               (0x0   << 4  )
#define FEECON1_MDIO_EN                (0x1   << 4  )

/* FEECON1[SWAP] - Swap program code for MDIO mode. */
#define FEECON1_SWAP_BBA               (*(volatile unsigned long *) 0x4230070C)
#define FEECON1_SWAP_MSK               (0x1   << 3  )
#define FEECON1_SWAP                   (0x1   << 3  )
#define FEECON1_SWAP_DIS               (0x0   << 3  )
#define FEECON1_SWAP_EN                (0x1   << 3  )

/* FEECON1[INCR] - Auto increment FEEFLAADR for non DMA operation. */
#define FEECON1_INCR_BBA               (*(volatile unsigned long *) 0x42300708)
#define FEECON1_INCR_MSK               (0x1   << 2  )
#define FEECON1_INCR                   (0x1   << 2  )
#define FEECON1_INCR_DIS               (0x0   << 2  ) /* Disable auto address increment */
#define FEECON1_INCR_EN                (0x1   << 2  ) /* Enable auto address increment */

/* FEECON1[KHDMA] - Key-hole DMA enable. */
#define FEECON1_KHDMA_BBA              (*(volatile unsigned long *) 0x42300704)
#define FEECON1_KHDMA_MSK              (0x1   << 1  )
#define FEECON1_KHDMA                  (0x1   << 1  )
#define FEECON1_KHDMA_DIS              (0x0   << 1  ) /* Disable DMA mode         */
#define FEECON1_KHDMA_EN               (0x1   << 1  ) /* Enable DMA mode          */

/* FEECON1[DBG] - JTAG debug enable */
#define FEECON1_DBG_BBA                (*(volatile unsigned long *) 0x42300700)
#define FEECON1_DBG_MSK                (0x1   << 0  )
#define FEECON1_DBG                    (0x1   << 0  )
#define FEECON1_DBG_DIS                (0x0   << 0  ) /* Disable JTAG access      */
#define FEECON1_DBG_EN                 (0x1   << 0  ) /* Enable JTAG access       */

/* Reset Value for FEEWRADDRA*/
#define FEEWRADDRA_RVAL                0x0 

/* FEEWRADDRA[WrAbortAddr] - If a write is aborted then this will contain the address of the location been written when the write was aborted. This register has appropriate value if command abort happened. This has to be read after the command is aborted. And this has to be read before any other command is given. After reset the value will be random. */
#define FEEWRADDRA_WrAbortAddr_MSK     (0xFFFFFFFF << 0  )

/* Reset Value for FEEAEN0*/
#define FEEAEN0_RVAL                   0x0 

/* FEEAEN0[SysIrqAbortEn] - Lower 32 bits of System Interrupt Abort Enable. To allow a system interrupt to abort a command (write, erase, sign or mass verify) then write a '1' to the appropriate bit in this register. */
#define FEEAEN0_SysIrqAbortEn_MSK      (0xFFFFFFFF << 0  )

/* Reset Value for FEEAEN1*/
#define FEEAEN1_RVAL                   0x0 

/* FEEAEN1[SysIrqAbortEn] - Upper 23 bits of System Interrupt Abort Enable. To allow a system interrupt to abort a command (write, erase, sign or mass verify) then write a '1' to the appropriate bit in this register. */
#define FEEAEN1_SysIrqAbortEn_MSK      (0x7FFFFF << 0  )

/* Reset Value for FEEECCCONFIG*/
#define FEEECCCONFIG_RVAL              0x0 

/* FEEECCCONFIG[INT] - Interrupt enable when a ECC error happens during an AHB read from program or data flash. */
#define FEEECCCONFIG_INT_MSK           (0x3   << 3  )

/* FEEECCCONFIG[FAULT] - Signifies when to generate AHB error (HRESP = 1) when an ECC error happens - 1 bit error or 2 bit error. */
#define FEEECCCONFIG_FAULT_MSK         (0x3   << 1  )

/* FEEECCCONFIG[DIS] - ECC Disable bit. */
#define FEEECCCONFIG_DIS_BBA           (*(volatile unsigned long *) 0x42300C80)
#define FEEECCCONFIG_DIS_MSK           (0x1   << 0  )
#define FEEECCCONFIG_DIS               (0x1   << 0  )
#define FEEECCCONFIG_DIS_DIS           (0x0   << 0  )
#define FEEECCCONFIG_DIS_EN            (0x1   << 0  )

/* Reset Value for FEEECCADDR0*/
#define FEEECCADDR0_RVAL               0x0 

/* FEEECCADDR0[ADDR0] - This register has the address of flash0 for which ECC error is detected. */
#define FEEECCADDR0_ADDR0_MSK          (0x7FFFF << 0  )

/* Reset Value for FEEECCADDR1*/
#define FEEECCADDR1_RVAL               0x0 

/* FEEECCADDR1[ADDR1] - This register has the address of flash1 for which ECC error is detected. */
#define FEEECCADDR1_ADDR1_MSK          (0x7FFFF << 0  )

/* Reset Value for CACHESTAT*/
#define CACHESTAT_RVAL                 0x2 

/* CACHESTAT[DLOCK] - This bit is set when D-Cache is locked and cleared when D-cache is unlocked. */
#define CACHESTAT_DLOCK_BBA            (*(volatile unsigned long *) 0x42301848)
#define CACHESTAT_DLOCK_MSK            (0x1   << 18 )
#define CACHESTAT_DLOCK                (0x1   << 18 )
#define CACHESTAT_DLOCK_CLR            (0x0   << 18 )
#define CACHESTAT_DLOCK_SET            (0x1   << 18 )

/* CACHESTAT[DEN] - If this bit is set then D-Cache is enabled and when cleared D-Cache is disabled. This is also cleared when CACHESTAT[16] is set. */
#define CACHESTAT_DEN_BBA              (*(volatile unsigned long *) 0x42301844)
#define CACHESTAT_DEN_MSK              (0x1   << 17 )
#define CACHESTAT_DEN                  (0x1   << 17 )
#define CACHESTAT_DEN_CLR              (0x0   << 17 )
#define CACHESTAT_DEN_SET              (0x1   << 17 )

/* CACHESTAT[DINIT] - It is set when D-cache memory initialization starts and clears when initialization is done. D-Cache is disabled when this bit is set. */
#define CACHESTAT_DINIT_BBA            (*(volatile unsigned long *) 0x42301840)
#define CACHESTAT_DINIT_MSK            (0x1   << 16 )
#define CACHESTAT_DINIT                (0x1   << 16 )
#define CACHESTAT_DINIT_CLR            (0x0   << 16 )
#define CACHESTAT_DINIT_SET            (0x1   << 16 )

