koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* CACHESTAT[ILOCK] - This bit is set when I-Cache is locked and cleared when I-cache is unlocked. */
#define CACHESTAT_ILOCK_BBA            (*(volatile unsigned long *) 0x42301808)
#define CACHESTAT_ILOCK_MSK            (0x1   << 2  )
#define CACHESTAT_ILOCK                (0x1   << 2  )
#define CACHESTAT_ILOCK_CLR            (0x0   << 2  )
#define CACHESTAT_ILOCK_SET            (0x1   << 2  )

/* CACHESTAT[IEN] - If this bit is set then I-Cache is enabled and when cleared I-Cache is disabled. This is also cleared when CACHESTAT[0] is set. */
#define CACHESTAT_IEN_BBA              (*(volatile unsigned long *) 0x42301804)
#define CACHESTAT_IEN_MSK              (0x1   << 1  )
#define CACHESTAT_IEN                  (0x1   << 1  )
#define CACHESTAT_IEN_CLR              (0x0   << 1  )
#define CACHESTAT_IEN_SET              (0x1   << 1  )

/* CACHESTAT[IINIT] - It is set when I-cache memory initialization starts and clears when initialization is done. I-Cache is disabled when this bit is set. */
#define CACHESTAT_IINIT_BBA            (*(volatile unsigned long *) 0x42301800)
#define CACHESTAT_IINIT_MSK            (0x1   << 0  )
#define CACHESTAT_IINIT                (0x1   << 0  )
#define CACHESTAT_IINIT_CLR            (0x0   << 0  )
#define CACHESTAT_IINIT_SET            (0x1   << 0  )

/* Reset Value for CACHESETUP*/
#define CACHESETUP_RVAL                0x2 

/* CACHESETUP[DWRBUF] - If this bit is set, then for every AHB access, hit from WrBuffer is not checked. */
#define CACHESETUP_DWRBUF_BBA          (*(volatile unsigned long *) 0x423018CC)
#define CACHESETUP_DWRBUF_MSK          (0x1   << 19 )
#define CACHESETUP_DWRBUF              (0x1   << 19 )
#define CACHESETUP_DWRBUF_EN           (0x0   << 19 )
#define CACHESETUP_DWRBUF_DIS          (0x1   << 19 )

/* CACHESETUP[DLOCK] - If this bit is set, then D-cache contents are locked. Any new misses will not be replaced in D-Cache. This bit is cleared when CACHESETUP[16] is set. */
#define CACHESETUP_DLOCK_BBA           (*(volatile unsigned long *) 0x423018C8)
#define CACHESETUP_DLOCK_MSK           (0x1   << 18 )
#define CACHESETUP_DLOCK               (0x1   << 18 )
#define CACHESETUP_DLOCK_DIS           (0x0   << 18 )
#define CACHESETUP_DLOCK_EN            (0x1   << 18 )

/* CACHESETUP[DEN] - If this bit set, then D-Cache is enabled for AHB accesses. If 0, then D-cache is disabled, and all AHB accesses will be via Flash memory. This bit is cleared when CACHESETUP[16] is set. */
#define CACHESETUP_DEN_BBA             (*(volatile unsigned long *) 0x423018C4)
#define CACHESETUP_DEN_MSK             (0x1   << 17 )
#define CACHESETUP_DEN                 (0x1   << 17 )
#define CACHESETUP_DEN_DIS             (0x0   << 17 )
#define CACHESETUP_DEN_EN              (0x1   << 17 )

/* CACHESETUP[DINIT] - If this bit is set then the D-cache contents are initialized to all zeros. This bit will be cleared once the initialization starts. */
#define CACHESETUP_DINIT_BBA           (*(volatile unsigned long *) 0x423018C0)
#define CACHESETUP_DINIT_MSK           (0x1   << 16 )
#define CACHESETUP_DINIT               (0x1   << 16 )
#define CACHESETUP_DINIT_DIS           (0x0   << 16 )
#define CACHESETUP_DINIT_EN            (0x1   << 16 )

/* CACHESETUP[IRDBUF] - If this bit is set, then for every AHB access, hit from Read Buffer is not checked. */
#define CACHESETUP_IRDBUF_BBA          (*(volatile unsigned long *) 0x42301890)
#define CACHESETUP_IRDBUF_MSK          (0x1   << 4  )
#define CACHESETUP_IRDBUF              (0x1   << 4  )
#define CACHESETUP_IRDBUF_EN           (0x0   << 4  )
#define CACHESETUP_IRDBUF_DIS          (0x1   << 4  )

/* CACHESETUP[IWRBUF] - If this bit is set, then for every AHB access, hit from Write Buffer is not checked. */
#define CACHESETUP_IWRBUF_BBA          (*(volatile unsigned long *) 0x4230188C)
#define CACHESETUP_IWRBUF_MSK          (0x1   << 3  )
#define CACHESETUP_IWRBUF              (0x1   << 3  )
#define CACHESETUP_IWRBUF_EN           (0x0   << 3  )
#define CACHESETUP_IWRBUF_DIS          (0x1   << 3  )

/* CACHESETUP[ILOCK] - If this bit is set, then I-cache contents are locked. Any new misses won�t be replaced in I-Cache. This bit is cleared when CACHESETUP[0] is set. */
#define CACHESETUP_ILOCK_BBA           (*(volatile unsigned long *) 0x42301888)
#define CACHESETUP_ILOCK_MSK           (0x1   << 2  )
#define CACHESETUP_ILOCK               (0x1   << 2  )
#define CACHESETUP_ILOCK_DIS           (0x0   << 2  )
#define CACHESETUP_ILOCK_EN            (0x1   << 2  )

/* CACHESETUP[IEN] - If this bit set, then I-Cache is enabled for AHB accesses. If 0, then I-cache is disabled, and all AHB accesses will be via Flash memory. This bit is cleared when CACHESETUP[0] is set. */
#define CACHESETUP_IEN_BBA             (*(volatile unsigned long *) 0x42301884)
#define CACHESETUP_IEN_MSK             (0x1   << 1  )
#define CACHESETUP_IEN                 (0x1   << 1  )
#define CACHESETUP_IEN_DIS             (0x0   << 1  )
#define CACHESETUP_IEN_EN              (0x1   << 1  )

/* CACHESETUP[IINIT] - If this bit is set then the I-cache contents are initialized to all zeros. This bit will be cleared once the initialization starts. */
#define CACHESETUP_IINIT_BBA           (*(volatile unsigned long *) 0x42301880)
#define CACHESETUP_IINIT_MSK           (0x1   << 0  )
#define CACHESETUP_IINIT               (0x1   << 0  )
#define CACHESETUP_IINIT_DIS           (0x0   << 0  )
#define CACHESETUP_IINIT_EN            (0x1   << 0  )

/* Reset Value for CACHEKEY*/
#define CACHEKEY_RVAL                  0x0 

/* CACHEKEY[Key] - Cache Key register */
#define CACHEKEY_Key_MSK               (0xFFFFFFFF << 0  )


/*------------------------------------------------------------------------------
 *                                  GPIO
 *----------------------------------------------------------------------------*/

/**
 * @brief GPIO (MMR_GPIO)
 */

typedef struct {                            /*!< MMR_GPIO Structure                     */
  __IOM uint16_t  GPCON;                    /*!< GPIO Port configuration             */
  __IM  uint16_t  RESERVED0;
  __IOM uint8_t   GPOE;                     /*!< GPIO Port output enable             */
  __IM  uint8_t   RESERVED1[3];
  __IOM uint8_t   GPPUL;                    /*!< GPIO Port pullup enable             */
  __IM  uint8_t   RESERVED2[3];
  __IOM uint8_t   GPIE;                     /*!< GPIO Port input path enable         */
  __IM  uint8_t   RESERVED3[3];
  __IOM uint8_t   GPIN;                     /*!< GPIO Port registered data input     */
  __IM  uint8_t   RESERVED4[3];
  __IOM uint8_t   GPOUT;                    /*!< GPIO Port data output               */
  __IM  uint8_t   RESERVED5[3];
  __IOM uint8_t   GPSET;                    /*!< GPIO Port data out set              */
  __IM  uint8_t   RESERVED6[3];
  __IOM uint8_t   GPCLR;                    /*!< GPIO Port data out clear            */
  __IM  uint8_t   RESERVED7[3];
  __IOM uint8_t   GPTGL;                    /*!< GPIO Port pin toggle                */
  __IM  uint8_t   RESERVED8[3];
  __IOM uint8_t   GPODE;                    /*!< GPIO Port open drain enable         */
  __IM  uint8_t   RESERVED9[3];
} MMR_GPIO_t;

