koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
/* CLKCON0[CLKMUX] - Clock mux select */
#define CLKCON0_CLKMUX_MSK             (0x3   << 0  )
#define CLKCON0_CLKMUX_HFOSC           (0x0   << 0  ) /* High frequency internal oscillator (HFOSC) */
#define CLKCON0_CLKMUX_SPLL            (0x1   << 0  ) /* System PLL is selected (80 MHz) */
#define CLKCON0_CLKMUX_UPLL            (0x2   << 0  ) /* UPLL is selected (60 MHz) */
#define CLKCON0_CLKMUX_EXTCLK          (0x3   << 0  ) /* External GPIO port is selected (ECLKIN) */

/* Reset Value for CLKCON1*/
#define CLKCON1_RVAL                   0xA82 

/* CLKCON1[CDD2DCLK] - D2DCLK divide bits */
#define CLKCON1_CDD2DCLK_BBA           (*(volatile unsigned long *) 0x425000AC)
#define CLKCON1_CDD2DCLK_MSK           (0x1   << 11 )
#define CLKCON1_CDD2DCLK               (0x1   << 11 )
#define CLKCON1_CDD2DCLK_DIV1          (0x0   << 11 ) /* D2D_CLK frequency = HCLK frequency */
#define CLKCON1_CDD2DCLK_DIV2          (0x1   << 11 ) /* D2D_CLK frequency = half of HCLK frequency */

/* CLKCON1[CDPCLK] - PCLK divide bits */
#define CLKCON1_CDPCLK_MSK             (0x7   << 8  )
#define CLKCON1_CDPCLK_DIV1            (0x0   << 8  ) /* DIV1. Divide by 1 (PCLK is equal to root clock) */
#define CLKCON1_CDPCLK_DIV2            (0x1   << 8  ) /* DIV2. Divide by 2 (PCLK is half the frequency of root clock) */
#define CLKCON1_CDPCLK_DIV4            (0x2   << 8  ) /* DIV4. Divide by 4 (PCLK is quarter the frequency of root clock, 20 MHz) */
#define CLKCON1_CDPCLK_DIV8            (0x3   << 8  ) /* DIV8. Divide by 8        */
#define CLKCON1_CDPCLK_DIV16           (0x4   << 8  ) /* DIV16. Divide by 16      */
#define CLKCON1_CDPCLK_DIV32           (0x5   << 8  ) /* DIV32. Divide by 32      */
#define CLKCON1_CDPCLK_DIV64           (0x6   << 8  ) /* DIV64. Divide by 164     */
#define CLKCON1_CDPCLK_DIV128          (0x7   << 8  ) /* DIV128. Divide by 128    */

/* CLKCON1[CDHCLK] - HCLK divide bits */
#define CLKCON1_CDHCLK_MSK             (0x7   << 0  )
#define CLKCON1_CDHCLK_DIV1            (0x0   << 0  ) /* DIV1. Divide by 1 (HCLK is equal to root clock) */
#define CLKCON1_CDHCLK_DIV2            (0x1   << 0  ) /* DIV2. Divide by 2 (HCLK is half the frequency of root clock) */
#define CLKCON1_CDHCLK_DIV4            (0x2   << 0  ) /* DIV4. Divide by 4 (HCLK is quarter the frequency of root clock) */
#define CLKCON1_CDHCLK_DIV8            (0x3   << 0  ) /* DIV8. Divide by 8        */
#define CLKCON1_CDHCLK_DIV16           (0x4   << 0  ) /* DIV16.Divide by 16       */
#define CLKCON1_CDHCLK_DIV32           (0x5   << 0  ) /* DIV32.Divide by 32       */
#define CLKCON1_CDHCLK_DIV64           (0x6   << 0  ) /* DIV64.Divide by 64       */
#define CLKCON1_CDHCLK_DIV128          (0x7   << 0  ) /* DIV128. Divide by 128    */

/* Reset Value for CLKCON5*/
#define CLKCON5_RVAL                   0x0 

/* CLKCON5[D2DCLKOFF] - D2D clock user control */
#define CLKCON5_D2DCLKOFF_BBA          (*(volatile unsigned long *) 0x42500298)
#define CLKCON5_D2DCLKOFF_MSK          (0x1   << 6  )
#define CLKCON5_D2DCLKOFF              (0x1   << 6  )
#define CLKCON5_D2DCLKOFF_ON           (0x0   << 6  ) /* Clock on                 */
#define CLKCON5_D2DCLKOFF_OFF          (0x1   << 6  ) /* Clock off                */

/* CLKCON5[UCLKUARTOFF] - UART clock user control */
#define CLKCON5_UCLKUARTOFF_BBA        (*(volatile unsigned long *) 0x42500294)
#define CLKCON5_UCLKUARTOFF_MSK        (0x1   << 5  )
#define CLKCON5_UCLKUARTOFF            (0x1   << 5  )
#define CLKCON5_UCLKUARTOFF_ON         (0x0   << 5  ) /* Clock on                 */
#define CLKCON5_UCLKUARTOFF_OFF        (0x1   << 5  ) /* Clock off                */

/* CLKCON5[UCLKI2C1OFF] - I2C1 clock user control */
#define CLKCON5_UCLKI2C1OFF_BBA        (*(volatile unsigned long *) 0x42500290)
#define CLKCON5_UCLKI2C1OFF_MSK        (0x1   << 4  )
#define CLKCON5_UCLKI2C1OFF            (0x1   << 4  )
#define CLKCON5_UCLKI2C1OFF_ON         (0x0   << 4  ) /* Clock on                 */
#define CLKCON5_UCLKI2C1OFF_OFF        (0x1   << 4  ) /* Clock off                */

/* CLKCON5[UCLKI2C0OFF] - I2C0 clock user control */
#define CLKCON5_UCLKI2C0OFF_BBA        (*(volatile unsigned long *) 0x4250028C)
#define CLKCON5_UCLKI2C0OFF_MSK        (0x1   << 3  )
#define CLKCON5_UCLKI2C0OFF            (0x1   << 3  )
#define CLKCON5_UCLKI2C0OFF_ON         (0x0   << 3  ) /* Clock on                 */
#define CLKCON5_UCLKI2C0OFF_OFF        (0x1   << 3  ) /* Clock off                */

/* CLKCON5[UCLKSPI1OFF] - SPI1 clock user control */
#define CLKCON5_UCLKSPI1OFF_BBA        (*(volatile unsigned long *) 0x42500284)
#define CLKCON5_UCLKSPI1OFF_MSK        (0x1   << 1  )
#define CLKCON5_UCLKSPI1OFF            (0x1   << 1  )
#define CLKCON5_UCLKSPI1OFF_ON         (0x0   << 1  ) /* Clock on                 */
#define CLKCON5_UCLKSPI1OFF_OFF        (0x1   << 1  ) /* Clock off                */

/* CLKCON5[UCLKSPI0OFF] - SPI0 clock user control */
#define CLKCON5_UCLKSPI0OFF_BBA        (*(volatile unsigned long *) 0x42500280)
#define CLKCON5_UCLKSPI0OFF_MSK        (0x1   << 0  )
#define CLKCON5_UCLKSPI0OFF            (0x1   << 0  )
#define CLKCON5_UCLKSPI0OFF_ON         (0x0   << 0  ) /* Clock on                 */
#define CLKCON5_UCLKSPI0OFF_OFF        (0x1   << 0  ) /* Clock off                */

/* Reset Value for CLKSTAT0*/
#define CLKSTAT0_RVAL                  0x0 

/* CLKSTAT0[HFXTALNOK] - HF crystal not stable */
#define CLKSTAT0_HFXTALNOK_BBA         (*(volatile unsigned long *) 0x42500338)
#define CLKSTAT0_HFXTALNOK_MSK         (0x1   << 14 )
#define CLKSTAT0_HFXTALNOK             (0x1   << 14 )

/* CLKSTAT0[HFXTALOK] - HF crystal stable */
#define CLKSTAT0_HFXTALOK_BBA          (*(volatile unsigned long *) 0x42500334)
#define CLKSTAT0_HFXTALOK_MSK          (0x1   << 13 )
#define CLKSTAT0_HFXTALOK              (0x1   << 13 )

/* CLKSTAT0[HFXTALSTATUS] - HF crystal status */
#define CLKSTAT0_HFXTALSTATUS_BBA      (*(volatile unsigned long *) 0x42500330)
#define CLKSTAT0_HFXTALSTATUS_MSK      (0x1   << 12 )
#define CLKSTAT0_HFXTALSTATUS          (0x1   << 12 )

/* CLKSTAT0[SPLLUNLOCK] - System PLL unlock */
#define CLKSTAT0_SPLLUNLOCK_BBA        (*(volatile unsigned long *) 0x42500308)
#define CLKSTAT0_SPLLUNLOCK_MSK        (0x1   << 2  )
#define CLKSTAT0_SPLLUNLOCK            (0x1   << 2  )

/* CLKSTAT0[SPLLLOCK] - System PLL lock */
#define CLKSTAT0_SPLLLOCK_BBA          (*(volatile unsigned long *) 0x42500304)
#define CLKSTAT0_SPLLLOCK_MSK          (0x1   << 1  )
#define CLKSTAT0_SPLLLOCK              (0x1   << 1  )

/* CLKSTAT0[SPLLSTATUS] - System PLL status */
#define CLKSTAT0_SPLLSTATUS_BBA        (*(volatile unsigned long *) 0x42500300)
#define CLKSTAT0_SPLLSTATUS_MSK        (0x1   << 0  )
#define CLKSTAT0_SPLLSTATUS            (0x1   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        dma_ctl                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief dma_ctl (pADI_dma_ctl)
  */

typedef struct {                            /*!< pADI_dma_ctl Structure                 */
  __IO uint16_t  GPFDMACTL;                 /*!< DMA Channel Control                   */
  __I  uint16_t  RESERVED0;
  __IO uint32_t  L1SRAMCTL;                 /*!< L1SRAMCTL                             */
} ADI_dma_ctl_TypeDef;

/* Reset Value for GPFDMACTL*/
#define GPFDMACTL_RVAL                 0x0 

/* GPFDMACTL[GPFlash] - DMA Channel 13 Control */
#define GPFDMACTL_GPFlash_BBA          (*(volatile unsigned long *) 0x42502000)
#define GPFDMACTL_GPFlash_MSK          (0x1   << 0  )
#define GPFDMACTL_GPFlash              (0x1   << 0  )

/* Reset Value for L1SRAMCTL*/
#define L1SRAMCTL_RVAL                 0x0 

/* L1SRAMCTL[L1SRAMCTL] -  */
#define L1SRAMCTL_L1SRAMCTL_BBA        (*(volatile unsigned long *) 0x42502080)
#define L1SRAMCTL_L1SRAMCTL_MSK        (0x1   << 0  )
#define L1SRAMCTL_L1SRAMCTL            (0x1   << 0  )
#define L1SRAMCTL_L1SRAMCTL_DIS        (0x0   << 0  )
#define L1SRAMCTL_L1SRAMCTL_EN         (0x1   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        SPI                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief spi0 (pADI_SPI0)
  */

