koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322.h
typedef struct {                            /*!< pADI_SPI0 Structure                    */
  __IO uint16_t  SPISTA;                    /*!< Status register                       */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  SPIRX;                     /*!< Receive register                      */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  SPITX;                     /*!< Transmit register                     */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  SPIDIV;                    /*!< Baud rate selection register          */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  SPICON;                    /*!< SPI configuration register            */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  SPIDMA;                    /*!< SPI DMA enable register               */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  SPICNT;                    /*!< Transfer byte count register          */
} ADI_SPI_TypeDef;

/* Reset Value for SPI0STA*/
#define SPI0STA_RVAL                   0x0 

/* SPI0STA[CSRSG] - Detected a rising edge on CS, in CONT mode */
#define SPI0STA_CSRSG_BBA              (*(volatile unsigned long *) 0x42580038)
#define SPI0STA_CSRSG_MSK              (0x1   << 14 )
#define SPI0STA_CSRSG                  (0x1   << 14 )
#define SPI0STA_CSRSG_CLR              (0x0   << 14 ) /* Cleared to 0 when the Status register is read. */
#define SPI0STA_CSRSG_SET              (0x1   << 14 ) /* Set to 1 when there was a rising edge in CS line, when the device was in master mode, continuous transfer, High Frequency mode and CSIRQ_EN was asserted. */

/* SPI0STA[CSFLG] - Detected a falling edge on CS, in CONT mode */
#define SPI0STA_CSFLG_BBA              (*(volatile unsigned long *) 0x42580034)
#define SPI0STA_CSFLG_MSK              (0x1   << 13 )
#define SPI0STA_CSFLG                  (0x1   << 13 )
#define SPI0STA_CSFLG_CLR              (0x0   << 13 ) /* Cleared to 0 when the Status register is read. */
#define SPI0STA_CSFLG_SET              (0x1   << 13 ) /* Set to 1 when there was a falling edge in CS line, when the device was in master mode, continuous transfer, High Frequency mode and CSIRQ_EN was asserted */

/* SPI0STA[CSERR] - Detected a CS error condition */
#define SPI0STA_CSERR_BBA              (*(volatile unsigned long *) 0x42580030)
#define SPI0STA_CSERR_MSK              (0x1   << 12 )
#define SPI0STA_CSERR                  (0x1   << 12 )
#define SPI0STA_CSERR_CLR              (0x0   << 12 ) /* Cleared to 0 when the Status register is read. */
#define SPI0STA_CSERR_SET              (0x1   << 12 ) /* Set to 1 when the CS line was de-asserted abruptly, even before the full-byte of data was transmitted completely. This bit will cause an interrupt. */

/* SPI0STA[RXS] - SPI Rx FIFO excess bytes present */
#define SPI0STA_RXS_BBA                (*(volatile unsigned long *) 0x4258002C)
#define SPI0STA_RXS_MSK                (0x1   << 11 )
#define SPI0STA_RXS                    (0x1   << 11 )
#define SPI0STA_RXS_CLR                (0x0   << 11 ) /* This bit is cleared when the number of bytes in the FIFO is equal or less than the number in SPI0CON[15:14]. */
#define SPI0STA_RXS_SET                (0x1   << 11 ) /* This bit is set when there are more bytes in the Rx FIFO than indicated in the MOD bits in SPI0CON. */

/* SPI0STA[RXFSTA] - SPI Rx FIFO status */
#define SPI0STA_RXFSTA_MSK             (0x7   << 8  )
#define SPI0STA_RXFSTA_EMPTY           (0x0   << 8  ) /* Rx FIFO empty            */
#define SPI0STA_RXFSTA_ONEBYTE         (0x1   << 8  ) /* 1 valid byte in FIFO     */
#define SPI0STA_RXFSTA_TWOBYTES        (0x2   << 8  ) /* 2 valid bytes in the FIFO */
#define SPI0STA_RXFSTA_THREEBYTES      (0x3   << 8  ) /* 3 valid bytes in the FIFO */
#define SPI0STA_RXFSTA_FOURBYTES       (0x4   << 8  ) /* 4 valid bytes in the FIFO */

/* SPI0STA[RXOF] - SPI Rx FIFO overflow */
#define SPI0STA_RXOF_BBA               (*(volatile unsigned long *) 0x4258001C)
#define SPI0STA_RXOF_MSK               (0x1   << 7  )
#define SPI0STA_RXOF                   (0x1   << 7  )
#define SPI0STA_RXOF_CLR               (0x0   << 7  ) /* Cleared when the SPISTA register is read. */
#define SPI0STA_RXOF_SET               (0x1   << 7  ) /* Set when the Rx FIFO was already full when new data was loaded to the FIFO. This bit generates an interrupt except when RFLUSH is set in SPI0CON. */

/* SPI0STA[RX] - SPI Rx IRQ */
#define SPI0STA_RX_BBA                 (*(volatile unsigned long *) 0x42580018)
#define SPI0STA_RX_MSK                 (0x1   << 6  )
#define SPI0STA_RX                     (0x1   << 6  )
#define SPI0STA_RX_CLR                 (0x0   << 6  ) /* Cleared when the SPI0STA register is read. */
#define SPI0STA_RX_SET                 (0x1   << 6  ) /* Set when a receive interrupt occurs. This bit is set when TIM in SPI0CON is cleared and the required number of bytes have been received. */

/* SPI0STA[TX] - SPI Tx IRQ */
#define SPI0STA_TX_BBA                 (*(volatile unsigned long *) 0x42580014)
#define SPI0STA_TX_MSK                 (0x1   << 5  )
#define SPI0STA_TX                     (0x1   << 5  )
#define SPI0STA_TX_CLR                 (0x0   << 5  ) /* CLR. Cleared to 0 when the SPI0STA register is read. */
#define SPI0STA_TX_SET                 (0x1   << 5  ) /* SET. Set to 1 when a transmit interrupt occurs. This bit is set when TIM in SPI0CON is set and the required number of bytes have been transmitted. */

/* SPI0STA[TXUR] - SPI Tx FIFO underflow */
#define SPI0STA_TXUR_BBA               (*(volatile unsigned long *) 0x42580010)
#define SPI0STA_TXUR_MSK               (0x1   << 4  )
#define SPI0STA_TXUR                   (0x1   << 4  )
#define SPI0STA_TXUR_CLR               (0x0   << 4  ) /* Cleared to 0 when the SPI0STA register is read. */
#define SPI0STA_TXUR_SET               (0x1   << 4  ) /* Set  to 1 when a transmit is initiated without any valid data in the Tx FIFO. This bit generates an interrupt except when TFLUSH is set in SPI0CON. */

/* SPI0STA[TXFSTA] - SPI Tx FIFO status */
#define SPI0STA_TXFSTA_MSK             (0x7   << 1  )
#define SPI0STA_TXFSTA_EMPTY           (0x0   << 1  ) /* Tx FIFO empty            */
#define SPI0STA_TXFSTA_ONEBYTE         (0x1   << 1  ) /* 1 valid byte in FIFO     */
#define SPI0STA_TXFSTA_TWOBYTES        (0x2   << 1  ) /* 2 valid bytes in FIFO    */
#define SPI0STA_TXFSTA_THREEBYTES      (0x3   << 1  ) /* 3 valid bytes in FIFO    */
#define SPI0STA_TXFSTA_FOURBYTES       (0x4   << 1  ) /* 4 valid bytes in FIFO    */

/* SPI0STA[IRQ] - SPI Interrupt status */
#define SPI0STA_IRQ_BBA                (*(volatile unsigned long *) 0x42580000)
#define SPI0STA_IRQ_MSK                (0x1   << 0  )
#define SPI0STA_IRQ                    (0x1   << 0  )
#define SPI0STA_IRQ_CLR                (0x0   << 0  ) /* Cleared to 0 after reading SPI0STA. */
#define SPI0STA_IRQ_SET                (0x1   << 0  ) /* Set to 1 when an SPI based interrupt occurs. */

/* Reset Value for SPI0RX*/
#define SPI0RX_RVAL                    0x0 

